blog/metaphysics.protoverse.project.org
#+TITLE: No More Playing With "Building Blocks"
#+SUBTITLE: Protoverse: Metaphysics
#+DATE: <2023-08-22 Tue>
#+LANGUAGE: en
#+DESCRIPTION: Creating an artificial universe from scratch
#+KEYWORDS: metaphysics, process philosophy, alife, artificial universe, universal darwinism, natural selection, emergence, dynamic systems, chaos theory
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/metaphysics.protoverse.project.html">
#+SETUPFILE: ../static/setup.org
#+PROPERTY: header-args+ :eval no-export
#+OPTIONS:

#+ATTR_HTML: :class pager
#+begin_nav
This is part of the Protoverse project:
- [[file:introduction.protoverse.project.org][Introduction]]
- *[[file:metaphysics.protoverse.project.org][Metaphysics]]*
- [[file:engineering.protoverse.project.org][Technical Considerations]]
- [[file:resources.protoverse.project.org][Resources]]
- [[file:model.protoverse.project.org][Computational Model]]
- [[file:ethics.protoverse.project.org][Ethical Guidelines]]
#+end_nav

#+begin_message
WORK IN PROGRESS -- Just landed here? You may want to check out the [[file:introduction.protoverse.project.org][introduction]]. This is the current version of the metaphysics, an informal framework for the Protoverse. It's largely speculative and still unpolished, and it doesn't consider technical practicabilit (on purpose). Once the metaphysics feel integrated enough, I'm going to work on the the computational model.
#+end_message

#+TOC: headlines 3

* The Process-relational Paradigm

** Objects

#+begin_quote
"I see and touch these things? Are they not ... there?"
#+end_quote

It comes quite "natural" for us to view the world as an assembly of objects or discrete entities -- The neighbour's dog's nose, justice, this book, my kitchen, the three body problem -- are conventionally understood as "objects" in the broadest sense —- somehow more or less discrete "things" that "are". It's largely an /intuitive/ perspective. We're even having a special type of label for those things in our languages -- the noun.

#+begin_quote
"Well, these things are there if you believe in them, sort of. It's just ... they are not what they seem ... because first and foremost, they are not "things"; and secondly, they not are ..." @@html:&ast;@@X-Files melody playing@@html:&ast;@@;
#+end_quote

Concepts of "objects" with inherent "properties" seem an universal feature across human culture. However, there are some philosophical traditions unlike western philosophy, such as certain schools within Buddhism, where processual views of the universe are more the rule than exception: acknowledging flux, change and [[https://en.wikipedia.org/wiki/Prat%C4%ABtyasamutp%C4%81da][dependent origination]] rather than distinct, static objects.

Discrete objects seem to be most likely a result of cognitive evolution in humans and other animals. In non-human perception, the idea of objects might be different, subordinate, or even non-existent. We do not know too much about how other life experiences the world, but this might stimulate us to reconsider our methods and their limitations to understanding the arrangement beond human reality:

While humans are largely visually oriented, other animals rely more on sounds, smells, electric fields, or vibrations to various extends. For instance, dogs rely heavily on smell to make sense of the world. Even more than that -- dogs seem not to trust their eyes at all; their nose is the final instance. This kind of perception seems not so much centered on "objects", but gives them access olfactory landscapes that map out overlapping scent trails, conveying a wealth of process information such as the passage of time and the activities and even mood of other creatures (I wish I could find that TikTok again, where a dog follows overlapping scent trails in a city neighbourhood).

Well, have you ever experienced that: You're sitting at the beach, watching the sun disappear behind the horizon — and suddenly there comes this moment of awe, where you realize that it is the ground that tilts beneath you? You experience the vast sphere rolling backwards away from the diminishing light, taking you with it? (The effect is best experienced when there are no distractions in your peripheral vision -- e.g. you sit on a spit -- so that you see nothing but the beach, water and the sky)

