blog/metaphysics.protoverse.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-04-17 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>No More Playing With "Building Blocks"</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Creating an artificial universe from scratch" />
<meta name="keywords" content="metaphysics, process philosophy, alife, artificial universe, universal darwinism, natural selection, emergence, dynamic systems, chaos theory" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka-etoile/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/cormorant/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/gentium-basic/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka-aile/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/metaphysics.protoverse.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2025-04-17">Last updated: 2025-04-17</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">No More Playing With &ldquo;Building Blocks&rdquo;</h1>
<p class="subtitle" role="doc-subtitle">Protoverse: Metaphysics</p>
</header><nav class="pager" id="org7b95fa8">
<p>
This is part of the Protoverse project:<br>
</p>
<ul class="org-ul">
<li><a href="introduction.protoverse.project.html">Introduction</a><br></li>
<li><b><a href="metaphysics.protoverse.project.html">Metaphysics</a></b><br></li>
<li><a href="engineering.protoverse.project.html">Technical Considerations</a><br></li>
<li><a href="resources.protoverse.project.html">Resources</a><br></li>
<li><a href="model.protoverse.project.html">Computational Model</a><br></li>
<li><a href="ethics.protoverse.project.html">Ethical Guidelines</a><br></li>
</ul>
</nav>

<div class="message" id="orgdb8832a">
<p>
WORK IN PROGRESS &#x2013; Just landed here? You may want to check out the <a href="introduction.protoverse.project.html">introduction</a>. This is the current version of the metaphysics, an informal framework for the Protoverse that aims to cover ontology, cosmology and epistemology. It&rsquo;s largely speculative and still unpolished, and it doesn&rsquo;t consider technical practicability. Once the metaphysics feel integrated enough, I&rsquo;m going to work on the the computational model.<br>
</p>

</div>

<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgad464d9">The Process-relational Paradigm</a>
<ul>
<li><a href="#orgd716171">Objects</a>
<ul>
<li><a href="#orge8537a3">There is no Spoon</a></li>
<li><a href="#org127fcaa">Objects Are Merely Abstractions</a></li>
<li><a href="#org613d3fb">If All You Have is a Hammer &#x2026;</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2cab3ae">What are Processes?</a>
<ul>
<li><a href="#orgf2e701c">Processes are Observers</a></li>
<li><a href="#org272cdec">Process as the Primary Abstraction</a></li>
<li><a href="#org395357f">Necessary Process Characteristics</a></li>
<li><a href="#org66c5b1a">Low-level Process Interaction</a>
<ul>
<li><a href="#org409dcda">Difference, Equality and Repetition</a></li>
<li><a href="#org7f44ca6">Baseline or Reference</a></li>
<li><a href="#org00d38c9">Inherent Uncertainty</a></li>
<li><a href="#org84bee3e">Identity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgaac7295">From Subjective Experience to Shared Reality</a>
<ul>
<li><a href="#org4c362e2">Access to Information</a>
<ul>
<li><a href="#org7dc05c4">Towards Evolving Scope and Interface</a></li>
</ul>
</li>
<li><a href="#org97bdaa6">How can Processes Account for Shared Realities?</a>
<ul>
<li><a href="#orgbfca3a2">Models are more deeply Nested Scales Of Complexity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1cd7bd9">Navigating Uncertainty</a></li>
<li><a href="#org04c7019">Universal Darwinism</a>
<ul>
<li><a href="#org159c068">Reception of Universal Darwinism</a>
<ul>
<li><a href="#orgf603de5">Misinterpretation of Implementation Details</a></li>
<li><a href="#orgbc5b2c1">Lack of an Integrative Multi-Scale Framework</a></li>
</ul>
</li>
<li><a href="#org3174615">Algorithmic Nature of Evolution</a>
<ul>
<li><a href="#orgf0e7873">General Principles of Evolutionary Dynamics</a></li>
<li><a href="#org6b76b9a">Research Concerning The Evolution of Evolution</a></li>
</ul>
</li>
<li><a href="#org12b3903">Nested Scales of Complexity</a>
<ul>
<li><a href="#orgc7d6f67">Interscale Connectivity</a></li>
<li><a href="#org246b2ca">Catalytic Transitions</a></li>
<li><a href="#org6c89cbc">No Privileged Nested Scales of Complexity</a></li>
<li><a href="#org3e12c90">Questions and Answers</a></li>
<li><a href="#org5688e56">Resemblances Within Other Theories and Areas</a></li>
</ul>
</li>
<li><a href="#org7c5c97e">Relation between Entropy and Evolution</a></li>
<li><a href="#org6d68416">Darwin-style Evolution in an Artificial Universe</a>
<ul>
<li><a href="#org92598c9">Necessary Conditions for Open-Ended Evolution</a></li>
<li><a href="#org0946d62">Drivers of Computational Evolution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3601c33">Traditional Metaphysical Questions</a>
<ul>
<li><a href="#orga80c591">Existing vs. Not Existing</a></li>
<li><a href="#org040a4ab">Abstract vs. Concrete</a>
<ul>
<li><a href="#org2b712a6">What are Numbers?</a></li>
<li><a href="#org0be0ce0">The Infinite</a></li>
<li><a href="#orgda8d7a2">The Problem of Universals</a></li>
<li><a href="#orgaf9872a">Conceptual Pluralism</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgde550d2">Meta</a>
<ul>
<li><a href="#orgbca8335">Design Guidelines</a></li>
</ul>
</li>
<li><a href="#org0f14084">Scratchpad</a>
<ul>
<li><a href="#orgbb66c1a">Is There an Ultimate Reality?</a></li>
<li><a href="#orga9106d4">Relevant beliefs and values:</a></li>
<li><a href="#org016139f">Delimited Relational State Update</a></li>
<li><a href="#org9ddad7b">Cognitive object-heuristic and Platonic thinking</a></li>
<li><a href="#org2c075bf">Approximation and Uncertainty in Nature</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-orgad464d9" class="outline-2">
<h2 id="orgad464d9"><a href="#orgad464d9">The Process-relational Paradigm</a></h2>
<div class="outline-text-2" id="text-orgad464d9">
</div>
<div id="outline-container-orgd716171" class="outline-3">
<h3 id="orgd716171"><a href="#orgd716171">Objects</a></h3>
<div class="outline-text-3" id="text-orgd716171">
<blockquote>
<p>
&ldquo;I see and touch these things? Are they not &#x2026; there?&rdquo;<br>
</p>
</blockquote>

<p>
It comes quite &ldquo;natural&rdquo; for us to view the world as an assembly of objects or discrete entities &#x2013; The neighbour&rsquo;s dog&rsquo;s nose, justice, this book, my kitchen, the three body problem &#x2013; are conventionally understood as &ldquo;objects&rdquo; in the broadest sense —- somehow more or less discrete &ldquo;things&rdquo; that &ldquo;are&rdquo;. It&rsquo;s largely an <i>intuitive</i> perspective. We&rsquo;re even having a special type of label for those things in our languages &#x2013; the noun.<br>
</p>

<blockquote>
<p>
&ldquo;Well, these things are there if you believe in them, sort of. It&rsquo;s just &#x2026; they are not what they seem &#x2026; because first and foremost, they are not &rdquo;things&ldquo;; and secondly, they not are &#x2026;&rdquo; &ast;X-Files melody playing&ast;;<br>
</p>
</blockquote>

<p>
Concepts of &ldquo;objects&rdquo; with inherent &ldquo;properties&rdquo; seem an universal feature across human culture. However, there are some philosophical traditions unlike western philosophy, such as certain schools within Buddhism, where processual views of the universe are more the rule than exception: acknowledging flux, change and <a href="https://en.wikipedia.org/wiki/Prat%C4%ABtyasamutp%C4%81da">dependent origination</a> rather than distinct, static objects.<br>
</p>

<p>
Discrete objects seem to be most likely a result of cognitive evolution in humans and other animals. In non-human perception, the idea of objects might be different, subordinate, or even non-existent. We do not know too much about how other life experiences the world, but this might stimulate us to reconsider our methods and their limitations to understanding the arrangement beond human reality:<br>
</p>

<p>
While humans are largely visually oriented, other animals rely more on sounds, smells, electric fields, or vibrations to various extends. For instance, dogs rely heavily on smell to make sense of the world. Even more than that &#x2013; dogs seem not to trust their eyes at all; their nose is the final instance. This kind of perception seems not so much centered on &ldquo;objects&rdquo;, but gives them access olfactory landscapes that map out overlapping scent trails, conveying a wealth of process information such as the passage of time and the activities and even mood of other creatures (I wish I could find that TikTok again, where a dog follows overlapping scent trails in a city neighbourhood).<br>
</p>

<p>
Well, have you ever experienced that: You&rsquo;re sitting at the beach, watching the sun disappear behind the horizon — and suddenly there comes this moment of awe, where you realize that it is the ground that tilts beneath you? You experience the vast sphere rolling backwards away from the diminishing light, taking you with it? (The effect is best experienced when there are no distractions in your peripheral vision &#x2013; e.g. you sit on a spit &#x2013; so that you see nothing but the beach, water and the sky)<br>
</p>
</div>
