blog/metaphysics.protoverse.project.org
*** There is no Spoon

The realization that there are in fact no stable objects, no "things" to find anywhere you look, comes more gradually though. Like in my the example concering the rotating earth, the intensity of that experience has to do with our temporal perception — and wether you can detect a notion of change or not (it also helps to watch timelapses).

The perspective widens even more, if you zoom out and set the time of an average human's lifespan in relation with the earth's or the universe's estimated age. You will realize there's actually nothing intrinsically special about what we consider "vast" or "incredibly tiny". Even 500 years old trees are wood fountains that blip up and perish like fireworks. Once you keep that in mind, you might assign much less significance to "objects", or hold on to a static, stable and substantial understanding of reality.

Change can be frightening, and I think that's because it is so un-intuitive. Change underlies the unknown, the unstable and uncertain. Humans likes "to break things down" into neat pieces: In order to create the object-illusion, cognition splits perception into discrete pieces, removes these pieces from context and augments the fragments with mind-borne constructs. It does it so well, so that it feels like entirely real, "out there".

*** Objects Are Merely Abstractions

All objects should be regarded as epiphenomena -- approximate and incomplete descriptions of underlying, ever-changing processes. "Things" are results of cognitive processes that provide a subjective, reductionist simplification that we commonly call "reality". Using common terminology, it means that both "concrete objects" and "abstract objects" are actually abstract objects.

It doesn't mean that the "object"-abstraction is bad or we shouldn't use it -- it's not bad in the same sense a spoon is not bad for soup. But this cheaply available abstraction does not make them fundamental "building blocks" of reality, the universe and everything.

*** If All You Have is a Hammer ...

Wouldn't it be quite a stretch to assume that a primitive cognitive pattern-recognition abstraction, evolved towards optimizing for survival and reproduction in a range of animals adapted to planet-bound environments, could be adequate to make sense of the universe and reality at all scales?

Of course that's not the whole story: Certainly, humans are developing tools and methods like mathematics and technology to overcome their limitations. But a closer look reveals that most methods are built on the the same substance-materialist preconceptions.

A whole "universe" has been created around the idea of objects in various manifestations, e.g. 'person', 'number' or 'particle', assuming that they must be somehow special, important or fundamental — just because they seem so /intuitive/ — "I think, therefore they are", no? Who in his right mind could deny that?

But our theories might be much more contingent on human intuition than we usually admit. There are numerous hints, that we long ago entered territory where our intuitive concept of a substance-based reality is a hindrance, has lost it's use, or is falling apart entirely: when grappling with abstract concepts (like emotions, mathematics, software), emergent phenomena (like businesses or complex systems), and fields on the edge of human knowledge (such as neuroscience, quantum mechanics and consciousness).

The nasty habit to objectify everything may cause us to miss important subtleties, so that there will be subtly growing gaps in our understanding of ever-changing complex systems, as long as we fail to /update our repertoire of intuitions/.

Certain phenomena may appear overly complicated or even paradoxical only because we use inadequate abstractions to begin with. What about the particle zoo, the 1001 interpretations of quantum mechanics, particle-wave duality? What else?

We'll need to consider a paradigm shift: a worldview constituted from /process, relation and transformation/, to finally get out of the stuffy theater where the particles dance to the beat of time on a stage of space.

* What are Processes?

It seems commonly accepted to say that there could be many patterns in our universe that certain "observers" might recognize that others might not — due to their evolutionary, cultural, cognitive or technological limitations, advancements or perspectives.

A [[https://www.youtube.com/watch?v=jlqqZZ7q4-s][vine]] certainly may not experience reality like a [[https://www.youtube.com/watch?v=Qv-ETrzgOj8][gecko]] does. There are countless examples that suggest our perception and understanding of reality must be hopelessly subjective too, depending on the patterns we're able to observe, describe and make sense of.

There are various conventions what 'observer' means, leading to much confusion. We tend to understand 'observer' as part of the duality (observer/observed), an abstract "measuring device", sometimes presume an absolute perspective, a passive role, or even a conscious entity. I used the term 'observer' out of habit when I began to throw together the first vague ideas.

If we speak of /happening/ rather than /being/, we shift the perspective from "things" to "processes". Processes are /immaterial/ -- spread out "over time" and "space", not neatly encapsulated within intuitive, definitive boundaries how humans like it; and Processes even change and dissolve our concept of identity ([[https://en.wikipedia.org/wiki/Ship_of_Theseus][Ship of Theseus]]). I guess that's why Processes haven't received nearly as much love as they should. Well, even matter turned out immaterial -- so it's not that much of a toad to swallow when I suggest that /all things/ existing are just conglomerates of Processes in constant flux.

"Building blocks" can't build anything -- things can't. But when we shift your thinking from "things" to Processes, we'll realize that Processes /can do/ -- because Processes are /subjects/ rather than /objects/; verbs instead of nouns. The implications of this notion become particularly striking when we consider the scales outside of the "living".

Processes interact, establish feedback loops and constitute all kinds of systems, from extremely simple to extremely complex. Like Darwinism describes (and Daniel Dennet further elaborated in his book "Darwin's Dangerous Idea"): for such complex systems as 'life' to arrive, there's no need for teleological agency or "mind". And based on the Process abstraction, the entire spectrum of existence can be modeled.

