blog/metaphysics.protoverse.project.html
<div id="outline-container-orge8537a3" class="outline-4">
<h4 id="orge8537a3"><a href="#orge8537a3">There is no Spoon</a></h4>
<div class="outline-text-4" id="text-orge8537a3">
<p>
The realization that there are in fact no stable objects, no &ldquo;things&rdquo; to find anywhere you look, comes more gradually though. Like in my the example concering the rotating earth, the intensity of that experience has to do with our temporal perception — and wether you can detect a notion of change or not (it also helps to watch timelapses).<br>
</p>

<p>
The perspective widens even more, if you zoom out and set the time of an average human&rsquo;s lifespan in relation with the earth&rsquo;s or the universe&rsquo;s estimated age. You will realize there&rsquo;s actually nothing intrinsically special about what we consider &ldquo;vast&rdquo; or &ldquo;incredibly tiny&rdquo;. Even 500 years old trees are wood fountains that blip up and perish like fireworks. Once you keep that in mind, you might assign much less significance to &ldquo;objects&rdquo;, or hold on to a static, stable and substantial understanding of reality.<br>
</p>

<p>
Change can be frightening, and I think that&rsquo;s because it is so un-intuitive. Change underlies the unknown, the unstable and uncertain. Humans likes &ldquo;to break things down&rdquo; into neat pieces: In order to create the object-illusion, cognition splits perception into discrete pieces, removes these pieces from context and augments the fragments with mind-borne constructs. It does it so well, so that it feels like entirely real, &ldquo;out there&rdquo;.<br>
</p>
</div>
</div>
<div id="outline-container-org127fcaa" class="outline-4">
<h4 id="org127fcaa"><a href="#org127fcaa">Objects Are Merely Abstractions</a></h4>
<div class="outline-text-4" id="text-org127fcaa">
<p>
All objects should be regarded as epiphenomena &#x2013; approximate and incomplete descriptions of underlying, ever-changing processes. &ldquo;Things&rdquo; are results of cognitive processes that provide a subjective, reductionist simplification that we commonly call &ldquo;reality&rdquo;. Using common terminology, it means that both &ldquo;concrete objects&rdquo; and &ldquo;abstract objects&rdquo; are actually abstract objects.<br>
</p>

<p>
It doesn&rsquo;t mean that the &ldquo;object&rdquo;-abstraction is bad or we shouldn&rsquo;t use it &#x2013; it&rsquo;s not bad in the same sense a spoon is not bad for soup. But this cheaply available abstraction does not make them fundamental &ldquo;building blocks&rdquo; of reality, the universe and everything.<br>
</p>
</div>
</div>
<div id="outline-container-org613d3fb" class="outline-4">
<h4 id="org613d3fb"><a href="#org613d3fb">If All You Have is a Hammer &#x2026;</a></h4>
<div class="outline-text-4" id="text-org613d3fb">
<p>
Wouldn&rsquo;t it be quite a stretch to assume that a primitive cognitive pattern-recognition abstraction, evolved towards optimizing for survival and reproduction in a range of animals adapted to planet-bound environments, could be adequate to make sense of the universe and reality at all scales?<br>
</p>

<p>
Of course that&rsquo;s not the whole story: Certainly, humans are developing tools and methods like mathematics and technology to overcome their limitations. But a closer look reveals that most methods are built on the the same substance-materialist preconceptions.<br>
</p>

<p>
A whole &ldquo;universe&rdquo; has been created around the idea of objects in various manifestations, e.g. &rsquo;person&rsquo;, &rsquo;number&rsquo; or &rsquo;particle&rsquo;, assuming that they must be somehow special, important or fundamental — just because they seem so <i>intuitive</i> — &ldquo;I think, therefore they are&rdquo;, no? Who in his right mind could deny that?<br>
</p>

<p>
But our theories might be much more contingent on human intuition than we usually admit. There are numerous hints, that we long ago entered territory where our intuitive concept of a substance-based reality is a hindrance, has lost it&rsquo;s use, or is falling apart entirely: when grappling with abstract concepts (like emotions, mathematics, software), emergent phenomena (like businesses or complex systems), and fields on the edge of human knowledge (such as neuroscience, quantum mechanics and consciousness).<br>
</p>

<p>
The nasty habit to objectify everything may cause us to miss important subtleties, so that there will be subtly growing gaps in our understanding of ever-changing complex systems, as long as we fail to <i>update our repertoire of intuitions</i>.<br>
</p>

<p>
Certain phenomena may appear overly complicated or even paradoxical only because we use inadequate abstractions to begin with. What about the particle zoo, the 1001 interpretations of quantum mechanics, particle-wave duality? What else?<br>
</p>

<p>
We&rsquo;ll need to consider a paradigm shift: a worldview constituted from <i>process, relation and transformation</i>, to finally get out of the stuffy theater where the particles dance to the beat of time on a stage of space.<br>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org2cab3ae" class="outline-2">
<h2 id="org2cab3ae"><a href="#org2cab3ae">What are Processes?</a></h2>
<div class="outline-text-2" id="text-org2cab3ae">
<p>
It seems commonly accepted to say that there could be many patterns in our universe that certain &ldquo;observers&rdquo; might recognize that others might not — due to their evolutionary, cultural, cognitive or technological limitations, advancements or perspectives.<br>
</p>

<p>
A <a href="https://www.youtube.com/watch?v=jlqqZZ7q4-s">vine</a> certainly may not experience reality like a <a href="https://www.youtube.com/watch?v=Qv-ETrzgOj8">gecko</a> does. There are countless examples that suggest our perception and understanding of reality must be hopelessly subjective too, depending on the patterns we&rsquo;re able to observe, describe and make sense of.<br>
</p>

<p>
There are various conventions what &rsquo;observer&rsquo; means, leading to much confusion. We tend to understand &rsquo;observer&rsquo; as part of the duality (observer/observed), an abstract &ldquo;measuring device&rdquo;, sometimes presume an absolute perspective, a passive role, or even a conscious entity. I used the term &rsquo;observer&rsquo; out of habit when I began to throw together the first vague ideas.<br>
</p>

<p>
If we speak of <i>happening</i> rather than <i>being</i>, we shift the perspective from &ldquo;things&rdquo; to &ldquo;processes&rdquo;. Processes are <i>immaterial</i> &#x2013; spread out &ldquo;over time&rdquo; and &ldquo;space&rdquo;, not neatly encapsulated within intuitive, definitive boundaries how humans like it; and Processes even change and dissolve our concept of identity (<a href="https://en.wikipedia.org/wiki/Ship_of_Theseus">Ship of Theseus</a>). I guess that&rsquo;s why Processes haven&rsquo;t received nearly as much love as they should. Well, even matter turned out immaterial &#x2013; so it&rsquo;s not that much of a toad to swallow when I suggest that <i>all things</i> existing are just conglomerates of Processes in constant flux.<br>
</p>

<p>
&ldquo;Building blocks&rdquo; can&rsquo;t build anything &#x2013; things can&rsquo;t. But when we shift your thinking from &ldquo;things&rdquo; to Processes, we&rsquo;ll realize that Processes <i>can do</i> &#x2013; because Processes are <i>subjects</i> rather than <i>objects</i>; verbs instead of nouns. The implications of this notion become particularly striking when we consider the scales outside of the &ldquo;living&rdquo;.<br>
</p>

<p>
Processes interact, establish feedback loops and constitute all kinds of systems, from extremely simple to extremely complex. Like Darwinism describes (and Daniel Dennet further elaborated in his book &ldquo;Darwin&rsquo;s Dangerous Idea&rdquo;): for such complex systems as &rsquo;life&rsquo; to arrive, there&rsquo;s no need for teleological agency or &ldquo;mind&rdquo;. And based on the Process abstraction, the entire spectrum of existence can be modeled.<br>
</p>
</div>
