blog/metaphysics.protoverse.project.org
** Processes are Observers

Quantum mechanics raised the suspicion of "observer dependency" -- but of course all kinds of systems are "observer-dependent" -- how could they not, if we recognize that they are entirely made from observers in the first place?

Processes naturally incorporate all requirements to be regarded as /observers/ across all (known) domains of inquiry, via their registration of change (or more specific: their own change) as a result of interaction (we could call that "Experience"). Further, they operate within a specific context, and adapt through feedback mechanisms. Observation is not an additional property but an intrinsic aspect of every Process, as they continually interact and adapt.

Observers arise on a spectrum, and they are pervasive. At this point we can merge 'observers' into /Processes/, which we will use as the prime abstraction within the Protoverse.

** Process as the Primary Abstraction

The Process abstracion is prior, and it's the only truly scale-invariant principle. Processes do not exist /within/ an environment or within space or time -- instead, the relational dynamics of processes bring about perceived structures and dimensions, as they continuously /become/ their environment, actively co-creating (co-evolving) the substrate they are operating at.

Analogy: much like cells in cellular automata, where the grid is not a pre-defined space, but each cell's state at a given step is determined by the states of its neighbouring cells at the previous step, so that the structure of the grid is inherently linked to the operation of the automaton (this aspect of principal unboundedness of cellular automata might be easily overlooked when playing with cellular automata within an app, where they are always displayed within a pre-defined area of a certain size). See also: [[https://en.wikipedia.org/wiki/Background_independence][Background independence]].

There are two distinct ideas about the fundamental constitution of Processes:

#+begin_index
 - *Primitive + higher-order style -- Processes all the way up:* The term 'Process' can refer to one single /primitive/ Process; but it can also mean a conglomerate of Processes, which can be described as one /higher-order/ Process. Both perspectives are equally valid when referring to different scales of complexity or different emergent phenomena. There's no upper limit to higher orders, but a lower end. Higher-order Processes are no "entities" or "actors", but emergent complex systems without fixed boundaries. This is quite like cells and patterns in cellular automata, as there's also a lower end to the pattern resolution --  the "primitive" single cell. I consider this as a pragmatic variant.

 - *Fractal style -- Processes all the way up and down:* In that scenario, Processes do not consist of primitive Processes, because there is no fundamental Scale and they are infinitely divisible into further Processes. This would be sort of a recursive, fractal-like structure. I consider that variant as quite elegant, since it would be truly one underlying principle from which all complexity emerges -- and who doesn't like fractals? However, there might be one interesting ontological fact to consider: The Protoverse itself as a computational model is no closed system, it merely qualifies as a new nested Scale that gives rise to potentially unlimited new Scales Of Complexity -- but it's fundamentally embedded in our universe.
#+end_index

Either way, I envision (primitive) Process as a meta-framework that describes Processes as the potential interactions between Processes.

** Necessary Process Characteristics

#+begin_index
- It would be quite unwieldy trying to figure out initial rules that produce viability, so there must be intrinsic adaption from the very beginning. Hence I lean towards the principle of Universal Darwinism (more about that later).

- Is the process-relational ontology monistic or pluralistic? It's actually both. The monist aspect of Processes as "universal" abstraction provides the neccessary compatibility required to interaction across Nested Scales of Complexity; the manifiestation of these emergent Scales in turn represent the pluralist aspect (each nested scale can emerge its own rules/dynamics), effectively leading to the potentially unlimited scaling required for open-endedness by quasi-darwinian evolution and the evolution of evolvability.

- (Primitive) Processes are essentially loops, like quasi-infinite recursive functions. So they would be naturally capable places to keep state, e.g. their relations to other Processes. It would be a matter of ontology design, if accessing a Process' state will require at least one "distinct" counterpart Process to determine the state of a Process (basically a form of "observer-dependency": evaluation by observation); or if a Process could access its state (introspection) or even manipulate it (reflection). Each way would have larger implications regarding ontology, epistemology and the computational implementation.

- If we could follow a [[https://en.wikipedia.org/wiki/Category:Markov_models][Markovian model]], each Process transitions from state to state based on current interactions only, without maintaining a history (I don't have an opinion about that right now, so just as a side note).

- Absolute compatibility in terms of interaction between higher-order Processes are (only) guaranteed at the Scale of their constituent primitive Processes. Higher-order Processes may develop various degrees of interaction -- e.g. more effective, efficient or richer "implementations", which may deviate significantly from the interactions of primitive Processes; e.g. they might interact via evolved, commonly shared protocols or languages. This leads to differentation in interaction capabilities and encapsulation; meaning not everything interacts with everything else to the same extend.
#+end_index

** Low-level Process Interaction

The primary concept of interaction between processes is the /Experience/. It seems like a suitable term for low-level as well as higher-level interactions. What does a Process experience? Patterns produced by other Processes, because there isn't anything other than Processes (no backdrop or stage-like "environment" -- Processes continuously /become/ (co-evolve) their environment).

You can understand Patterns as the raw data of Experience -- the unrealized potentials, 'not-yet-made-sense-of'. Patterns are not to be understood as static or dynamic, as this distinction would imply assumptions that are not justified if we look at Patterns in isolation.

Consequently, the counterpart Processes are also sharing that Experience. There's nothing to Experience without change; and likewise, change can't happen without (causing) an Experience somewhere: everything that happens, always has /some influence/ on another Process, even if this impact is so subtle that it is virtually imperceptible. Nothing exists in isolation. How Processes handle Experience, is another story.

