blog/metaphysics.protoverse.project.html
<div id="outline-container-orgf2e701c" class="outline-3">
<h3 id="orgf2e701c"><a href="#orgf2e701c">Processes are Observers</a></h3>
<div class="outline-text-3" id="text-orgf2e701c">
<p>
Quantum mechanics raised the suspicion of &ldquo;observer dependency&rdquo; &#x2013; but of course all kinds of systems are &ldquo;observer-dependent&rdquo; &#x2013; how could they not, if we recognize that they are entirely made from observers in the first place?<br>
</p>

<p>
Processes naturally incorporate all requirements to be regarded as <i>observers</i> across all (known) domains of inquiry, via their registration of change (or more specific: their own change) as a result of interaction (we could call that &ldquo;Experience&rdquo;). Further, they operate within a specific context, and adapt through feedback mechanisms. Observation is not an additional property but an intrinsic aspect of every Process, as they continually interact and adapt.<br>
</p>

<p>
Observers arise on a spectrum, and they are pervasive. At this point we can merge &rsquo;observers&rsquo; into <i>Processes</i>, which we will use as the prime abstraction within the Protoverse.<br>
</p>
</div>
</div>
<div id="outline-container-org272cdec" class="outline-3">
<h3 id="org272cdec"><a href="#org272cdec">Process as the Primary Abstraction</a></h3>
<div class="outline-text-3" id="text-org272cdec">
<p>
The Process abstracion is prior, and it&rsquo;s the only truly scale-invariant principle. Processes do not exist <i>within</i> an environment or within space or time &#x2013; instead, the relational dynamics of processes bring about perceived structures and dimensions, as they continuously <i>become</i> their environment, actively co-creating (co-evolving) the substrate they are operating at.<br>
</p>

<p>
Analogy: much like cells in cellular automata, where the grid is not a pre-defined space, but each cell&rsquo;s state at a given step is determined by the states of its neighbouring cells at the previous step, so that the structure of the grid is inherently linked to the operation of the automaton (this aspect of principal unboundedness of cellular automata might be easily overlooked when playing with cellular automata within an app, where they are always displayed within a pre-defined area of a certain size). See also: <a href="https://en.wikipedia.org/wiki/Background_independence">Background independence</a>.<br>
</p>

<p>
There are two distinct ideas about the fundamental constitution of Processes:<br>
</p>

<div class="index" id="orgd210455">
<ul class="org-ul">
<li><b>Primitive + higher-order style &#x2013; Processes all the way up:</b> The term &rsquo;Process&rsquo; can refer to one single <i>primitive</i> Process; but it can also mean a conglomerate of Processes, which can be described as one <i>higher-order</i> Process. Both perspectives are equally valid when referring to different scales of complexity or different emergent phenomena. There&rsquo;s no upper limit to higher orders, but a lower end. Higher-order Processes are no &ldquo;entities&rdquo; or &ldquo;actors&rdquo;, but emergent complex systems without fixed boundaries. This is quite like cells and patterns in cellular automata, as there&rsquo;s also a lower end to the pattern resolution &#x2013;  the &ldquo;primitive&rdquo; single cell. I consider this as a pragmatic variant.<br></li>

<li><b>Fractal style &#x2013; Processes all the way up and down:</b> In that scenario, Processes do not consist of primitive Processes, because there is no fundamental Scale and they are infinitely divisible into further Processes. This would be sort of a recursive, fractal-like structure. I consider that variant as quite elegant, since it would be truly one underlying principle from which all complexity emerges &#x2013; and who doesn&rsquo;t like fractals? However, there might be one interesting ontological fact to consider: The Protoverse itself as a computational model is no closed system, it merely qualifies as a new nested Scale that gives rise to potentially unlimited new Scales Of Complexity &#x2013; but it&rsquo;s fundamentally embedded in our universe.<br></li>
</ul>

</div>

<p>
Either way, I envision (primitive) Process as a meta-framework that describes Processes as the potential interactions between Processes.<br>
</p>
</div>
</div>
<div id="outline-container-org395357f" class="outline-3">
<h3 id="org395357f"><a href="#org395357f">Necessary Process Characteristics</a></h3>
<div class="outline-text-3" id="text-org395357f">
<div class="index" id="orgf1ecf92">
<ul class="org-ul">
<li>It would be quite unwieldy trying to figure out initial rules that produce viability, so there must be intrinsic adaption from the very beginning. Hence I lean towards the principle of Universal Darwinism (more about that later).<br></li>

<li>Is the process-relational ontology monistic or pluralistic? It&rsquo;s actually both. The monist aspect of Processes as &ldquo;universal&rdquo; abstraction provides the neccessary compatibility required to interaction across Nested Scales of Complexity; the manifiestation of these emergent Scales in turn represent the pluralist aspect (each nested scale can emerge its own rules/dynamics), effectively leading to the potentially unlimited scaling required for open-endedness by quasi-darwinian evolution and the evolution of evolvability.<br></li>

<li>(Primitive) Processes are essentially loops, like quasi-infinite recursive functions. So they would be naturally capable places to keep state, e.g. their relations to other Processes. It would be a matter of ontology design, if accessing a Process&rsquo; state will require at least one &ldquo;distinct&rdquo; counterpart Process to determine the state of a Process (basically a form of &ldquo;observer-dependency&rdquo;: evaluation by observation); or if a Process could access its state (introspection) or even manipulate it (reflection). Each way would have larger implications regarding ontology, epistemology and the computational implementation.<br></li>

<li>If we could follow a <a href="https://en.wikipedia.org/wiki/Category:Markov_models">Markovian model</a>, each Process transitions from state to state based on current interactions only, without maintaining a history (I don&rsquo;t have an opinion about that right now, so just as a side note).<br></li>

<li>Absolute compatibility in terms of interaction between higher-order Processes are (only) guaranteed at the Scale of their constituent primitive Processes. Higher-order Processes may develop various degrees of interaction &#x2013; e.g. more effective, efficient or richer &ldquo;implementations&rdquo;, which may deviate significantly from the interactions of primitive Processes; e.g. they might interact via evolved, commonly shared protocols or languages. This leads to differentation in interaction capabilities and encapsulation; meaning not everything interacts with everything else to the same extend.<br></li>
</ul>

</div>
</div>
</div>
<div id="outline-container-org66c5b1a" class="outline-3">
<h3 id="org66c5b1a"><a href="#org66c5b1a">Low-level Process Interaction</a></h3>
<div class="outline-text-3" id="text-org66c5b1a">
<p>
The primary concept of interaction between processes is the <i>Experience</i>. It seems like a suitable term for low-level as well as higher-level interactions. What does a Process experience? Patterns produced by other Processes, because there isn&rsquo;t anything other than Processes (no backdrop or stage-like &ldquo;environment&rdquo; &#x2013; Processes continuously <i>become</i> (co-evolve) their environment).<br>
</p>

<p>
You can understand Patterns as the raw data of Experience &#x2013; the unrealized potentials, &rsquo;not-yet-made-sense-of&rsquo;. Patterns are not to be understood as static or dynamic, as this distinction would imply assumptions that are not justified if we look at Patterns in isolation.<br>
</p>

<p>
Consequently, the counterpart Processes are also sharing that Experience. There&rsquo;s nothing to Experience without change; and likewise, change can&rsquo;t happen without (causing) an Experience somewhere: everything that happens, always has <i>some influence</i> on another Process, even if this impact is so subtle that it is virtually imperceptible. Nothing exists in isolation. How Processes handle Experience, is another story.<br>
</p>
</div>
