blog/metaphysics.protoverse.project.org
*** Difference, Equality and Repetition

Experience begins with something changing, and therefore registering of change. So what is even 'change' itself? It seems that change is noticing 'difference'. Oscillation. Oh, and 'waves' again. Yeah I mean it's quite understandable.

In order to build back 'change' from 'difference', there's something else involved. "Time?!" How bold of you to assume time exists a priori! Not so fast. If we think about difference, then there can't be a singular. Difference arises only if there are at least 2 states; or put another way: 2 states come into existence because there's differene.

But does that give us change? Well, not if these 2 states merely exist in juxtaposition, e.g. like 2 tiles next to each other. Even if these 2 tiles look the same, they are different alone by the fact that they are next to each other. Otherwise we couldn't recognize difference at all. But we do it, because implicit 'space' sneaked in here.

Ok, it seems that requires some /dimension/ to make 'difference' even possible. That sneaky little dimension is a carrier of relation. Well, that example is flawed from the beginning.

In order to make 'difference' /experiencable/ -- and therefore for change to be neccessary at all -- there must be an inability to comprehend more than 1 state at once? Don't think so. The (n)one becomes -- exhibits difference.

.....

For now, we should explore ways how a Process could recognize 'difference' in the first place. What comes to mind is /comparison/ with /indifference/. Hence, the concept of /equality/ ~=~ seems to be a suitable path to recognize 'difference', because it creates a counterart for comparison.

Difference/Equality form a dichotomy. We can look around for other pervasive dichotomies, but I couldn't identify any that has such a fundamental appeal to it, because the principle of 'dichotomy' itself hinges on 'difference'.

The question how to understand equality and how to implement it, is also fundamental in science, computer science, mathematics and logic -- and treated quite differently in each.

Why? Well ultimately, it seems because true or absolute equality is impossible in our universe, not only because no observer (as a part within the system) could compare /anything/ directly, but because even within our universe /there cannot be anything truly equal to anything else/. Let me explain:

While we might be able to fantasize absolute equality (within conceptual, abstract or formal systems), instantiating that equality in any way -- even by computational means -- will eventually run against the inherent uncertainties brought by quantum variability.

What we commonly resort to, is only a form of pseudo-equality (similarity) that usually relies on comparing /properties/.

But there's a caveat: there could be /potentially infinite properties/ assigned or realized "in" anything, so that a comprehensive list of properties is impossible due to the potentially inexhaustible amount of contexts and perspectives from which these properties could be drawn.

Hence, determining "properties" (a.k.a 'measuring) is always a matter of contextualization, /not of uncovering inherent characteristics/. The "properties" in question are being realized by the interacting Processes, as these build relations (or get "entangled") — and /these relations are the properties/.

Properties are relational rather than inherent -- there are no fixed "properties" per se "within" anything, that could be "universally agreed on" (by whom?). Hence, comparison should be a question of /comparing relations/, not "properties" themselves.

It could mean that "properties" as commonly understood, are not stable themselves. They might be immediately expiring snapshots of changing relations within the processual context. These snapshots could -- deceptively -- appear stable, but that's just because one is in fact looking at /another snapshot/ that has just the approximately same value.

The key question would be: Do the relationships between Processes last forever, once established? Which would lead to everlasting histories. Or can they be dissolved or transformed, e.g. =(A -> B -> C)= reduced to =(A -> C)=? Or shadowed? Under what /neccessary and organically arising/ circumstances?

  Mkay, let's resort to a real-world-example! So, a human is a plethora of processes that are constituted by related processes all the way down. By establishing relations over and over, this higher-order process emerges.

  But it doesn't end here. The human process -- let's call it "Stephania" -- constantly establishes more and more relations to other processes. And a plethora of "outside" processes mingle with this human process and the numerous processes that make up this human processes at various scales.

  Interrelated Processes transcend the categorizations we lay up on them: There's no /fundamental/ difference wether if a human Process establishes certain relations and fosters Processes that entangle into a baby, or into a bestseller book about home-treating hemorrhoids that relieves millions from pain in the ass.

  One sunny morning in June, Stephania is on the way to give a talk about her bestselling book. As she enters the grounds of the venue, she gets hit by a meteorite and Stephania evaporates in a split second. You may now ask yourself ... How big was that meteorite???

  That's not the point here ... focus, please. It seems obvious though, that higher-order Processes (Proscesses consisting of Processes) can perish -- by what means, exactly? Does that happen by /transformations/ or /deletion -- complete loss/? Some Processes dissolve, others persist, and new ones establish at that moment. What will be left by this impact? How far through the scales of Processes reaches the impact? What about the primitive Processes?

  To what degree could one Process re-instantiate another cheased high-level Processe, given that there would be traceable, intact relations (redundancy?) within the previously related Processes? How could they be captured?

