blog/metaphysics.protoverse.project.html
<div id="outline-container-org409dcda" class="outline-4">
<h4 id="org409dcda"><a href="#org409dcda">Difference, Equality and Repetition</a></h4>
<div class="outline-text-4" id="text-org409dcda">
<p>
Experience begins with something changing, and therefore registering of change. So what is even &rsquo;change&rsquo; itself? It seems that change is noticing &rsquo;difference&rsquo;. Oscillation. Oh, and &rsquo;waves&rsquo; again. Yeah I mean it&rsquo;s quite understandable.<br>
</p>

<p>
In order to build back &rsquo;change&rsquo; from &rsquo;difference&rsquo;, there&rsquo;s something else involved. &ldquo;Time?!&rdquo; How bold of you to assume time exists a priori! Not so fast. If we think about difference, then there can&rsquo;t be a singular. Difference arises only if there are at least 2 states; or put another way: 2 states come into existence because there&rsquo;s differene.<br>
</p>

<p>
But does that give us change? Well, not if these 2 states merely exist in juxtaposition, e.g. like 2 tiles next to each other. Even if these 2 tiles look the same, they are different alone by the fact that they are next to each other. Otherwise we couldn&rsquo;t recognize difference at all. But we do it, because implicit &rsquo;space&rsquo; sneaked in here.<br>
</p>

<p>
Ok, it seems that requires some <i>dimension</i> to make &rsquo;difference&rsquo; even possible. That sneaky little dimension is a carrier of relation. Well, that example is flawed from the beginning.<br>
</p>

<p>
In order to make &rsquo;difference&rsquo; <i>experiencable</i> &#x2013; and therefore for change to be neccessary at all &#x2013; there must be an inability to comprehend more than 1 state at once? Don&rsquo;t think so. The (n)one becomes &#x2013; exhibits difference.<br>
</p>

<p>
&#x2026;..<br>
</p>

<p>
For now, we should explore ways how a Process could recognize &rsquo;difference&rsquo; in the first place. What comes to mind is <i>comparison</i> with <i>indifference</i>. Hence, the concept of <i>equality</i> <code>=</code> seems to be a suitable path to recognize &rsquo;difference&rsquo;, because it creates a counterart for comparison.<br>
</p>

<p>
Difference/Equality form a dichotomy. We can look around for other pervasive dichotomies, but I couldn&rsquo;t identify any that has such a fundamental appeal to it, because the principle of &rsquo;dichotomy&rsquo; itself hinges on &rsquo;difference&rsquo;.<br>
</p>

<p>
The question how to understand equality and how to implement it, is also fundamental in science, computer science, mathematics and logic &#x2013; and treated quite differently in each.<br>
</p>

<p>
Why? Well ultimately, it seems because true or absolute equality is impossible in our universe, not only because no observer (as a part within the system) could compare <i>anything</i> directly, but because even within our universe <i>there cannot be anything truly equal to anything else</i>. Let me explain:<br>
</p>

<p>
While we might be able to fantasize absolute equality (within conceptual, abstract or formal systems), instantiating that equality in any way &#x2013; even by computational means &#x2013; will eventually run against the inherent uncertainties brought by quantum variability.<br>
</p>

<p>
What we commonly resort to, is only a form of pseudo-equality (similarity) that usually relies on comparing <i>properties</i>.<br>
</p>

<p>
But there&rsquo;s a caveat: there could be <i>potentially infinite properties</i> assigned or realized &ldquo;in&rdquo; anything, so that a comprehensive list of properties is impossible due to the potentially inexhaustible amount of contexts and perspectives from which these properties could be drawn.<br>
</p>

<p>
Hence, determining &ldquo;properties&rdquo; (a.k.a &rsquo;measuring) is always a matter of contextualization, <i>not of uncovering inherent characteristics</i>. The &ldquo;properties&rdquo; in question are being realized by the interacting Processes, as these build relations (or get &ldquo;entangled&rdquo;) — and <i>these relations are the properties</i>.<br>
</p>

<p>
Properties are relational rather than inherent &#x2013; there are no fixed &ldquo;properties&rdquo; per se &ldquo;within&rdquo; anything, that could be &ldquo;universally agreed on&rdquo; (by whom?). Hence, comparison should be a question of <i>comparing relations</i>, not &ldquo;properties&rdquo; themselves.<br>
</p>

<p>
It could mean that &ldquo;properties&rdquo; as commonly understood, are not stable themselves. They might be immediately expiring snapshots of changing relations within the processual context. These snapshots could &#x2013; deceptively &#x2013; appear stable, but that&rsquo;s just because one is in fact looking at <i>another snapshot</i> that has just the approximately same value.<br>
</p>

<p>
The key question would be: Do the relationships between Processes last forever, once established? Which would lead to everlasting histories. Or can they be dissolved or transformed, e.g. <code>(A -&gt; B -&gt; C)</code> reduced to <code>(A -&gt; C)</code>? Or shadowed? Under what <i>neccessary and organically arising</i> circumstances?<br>
</p>

<p>
Mkay, let&rsquo;s resort to a real-world-example! So, a human is a plethora of processes that are constituted by related processes all the way down. By establishing relations over and over, this higher-order process emerges.<br>
</p>

<p>
But it doesn&rsquo;t end here. The human process &#x2013; let&rsquo;s call it &ldquo;Stephania&rdquo; &#x2013; constantly establishes more and more relations to other processes. And a plethora of &ldquo;outside&rdquo; processes mingle with this human process and the numerous processes that make up this human processes at various scales.<br>
</p>

<p>
Interrelated Processes transcend the categorizations we lay up on them: There&rsquo;s no <i>fundamental</i> difference wether if a human Process establishes certain relations and fosters Processes that entangle into a baby, or into a bestseller book about home-treating hemorrhoids that relieves millions from pain in the ass.<br>
</p>

<p>
One sunny morning in June, Stephania is on the way to give a talk about her bestselling book. As she enters the grounds of the venue, she gets hit by a meteorite and Stephania evaporates in a split second. You may now ask yourself &#x2026; How big was that meteorite???<br>
</p>

<p>
That&rsquo;s not the point here &#x2026; focus, please. It seems obvious though, that higher-order Processes (Proscesses consisting of Processes) can perish &#x2013; by what means, exactly? Does that happen by <i>transformations</i> or <i>deletion &#x2013; complete loss</i>? Some Processes dissolve, others persist, and new ones establish at that moment. What will be left by this impact? How far through the scales of Processes reaches the impact? What about the primitive Processes?<br>
</p>

<p>
To what degree could one Process re-instantiate another cheased high-level Processe, given that there would be traceable, intact relations (redundancy?) within the previously related Processes? How could they be captured?<br>
</p>
</div>
</div>
