blog/metaphysics.protoverse.project.org
*** Baseline or Reference

Due to the lack of an objective reference, the nearest reasonable candidate for a baseline seems to use the notion of 'self'. In this view, the deviation from 'self' could become the reference for registering change [better ideas?].

'Self' must be built from a continuous Process then, which is influenced by Experiences, requiring self-identity to be an ongoing, dynamic process rather than a fixed, unchanging property. So how could we create an abstract notion of 'self' at a very low level?

A model of 'self' could be built from a loop by making Processes fundamentally recursive. That paves the way for preserving past states in a continually updated fashion. Recursion can enable feedback, self-adjusting behaviors, keeping state and even various degrees of 'learning'. Recursion could also be a preliminary step towards increasingly complex models of 'self' and its interactions with other Processes.

Further, it could make sense to introduce a notion of 'decay' into the recursion, so that the impact of recursive input decreases the further down the recursion chain. This is alike to what we recognize in certain biological and in psychological processes – e.g. when remembrance often favors more recent experiences over older ones when guiding future behavior (recency bias).

Not only may the influence of previous Experience decrease as per the decay principle, but also the precision of those past experiences might be degraded — they may become less orderly and more uncertain. It touches in some aspects the concept of /entropy/.

However, the idea of decay smells very bolted-on, and I'm not happy with this ad-hoc /implementation/ "let there be decay!". As I will have to think really hard about entropy sooner than later, that particular idea of decay for no other than practical reasons may not the be-all and end-all of wisdom.

What does all that mean for the Protoverse model?

*** Inherent Uncertainty

The concept of "equality" (necessary to register difference), is fundamentally an approximation ([[https://en.wikipedia.org/wiki/Indeterminacy_(philosophy)#Approximation_versus_equality][I just found out that Nietzsche discovered that too]]), and therefore introduces uncertainty. This may be a way how the Protoverse could give rise to ontic uncertainty at its lowest level — within the primitive interactions that are primarily concerned about registering difference.

This uncertainty makes the entire system fundamentally non-deterministic. From that follows that all kinds of things that we might like to describe as discrete entities ("objects" or "particles") are naturally approximations.

It further implies that there's would be no need to include explicit, bolted-on randomness in the Protoverse model. Redefining the meaning of /Equality/ itself would have to happen on the level of logic, and that also means a departure from /classical logic/.

I don't know if it's neccessary or sensible to augment (or even replace) classical logic in order to build this quantum-like, probablistic resp. non-deterministic system. There are /propability theory/ and the paradigms /propablistic programming/ and /non-deterministic programming/ (I'm entirely unfamiliar with both), and these seem to work without touching the underlying logic.

However, it feels more intuitive to me (haha!) to operate on the logic level -- maybe it make sense to adopt /fuzzy logic/. And while we're at it, we could also ditch the "Law of the excluded middle"! I've always been suspicious of it and could never accept it.

I don't object Planck's idea of the quantization in quantum mechanics, but that apparent quantization might be a phenomenon that appears due to discretization (for whatever reason) as an effect of the /approximation/ that I mentioned before -- well, if this actually happens in our universe. Could this unsharpness then provide an understanding of quantum uncertainty?

Ok, I'm probably mistaken -- but even if that's just bullshit, it leaves the impression that /quantum uncertainty may be not that weird/ actually (and could be understood intuitively, instead of accepting it at face value); and secondly, this concept might actually work as a computational substrate that shares some commonalities with quantum mechanics.

Approximation (and uncertainty) within our universe might be a broadly misunderstood part of nature, rooted in the mistaken assumption that "precision" must be somehow "prior", "superior" or "perfect" (looking at you, Plato and Descartes). Does it come from forcing the object-abstraction onto /everything/, just because the cognitive heuristic that builds objects form observed patterns feels so intuitive?

Maybe we could /intuitively understand/ quamtum mechanics (things like the uncertainty principle and particle-wave "duality'") and not merely accept it at face value, if we shift our perspective from a substantial-materialist (objects, particles, inherent properties) to process-relational worldview (processes, relations, participatory)?

*TL;DR*
There are no particles, because they would be still (abstract) objects, which are merely approximations (unsharp, uncertain), resulting from a heuristic (applied by an "observer") that builds the abstractions 'object' (and other fluff) which are incomplete and distorted descriptions of the underlying processes and relations. Give up on "building blocks"!

*** Identity

'Idenity' within this context means the [[https://en.wikipedia.org/wiki/Identity_(philosophy)][self-relation as in philosophy]], /not/ the concept of 'Identity' as in logic (that one I call 'Equality' with capital 'E', because it's a technical term and works differently from classic logic).

With 'identity' being nothing prior or special, everything that applies to generic properties also applies to 'identity'. What I particularly want to emphasize at this point, is that 'idenity', would not be stable or static at all.

In fact, there is no inherent or pre-defined concept of 'identity' within the Protoverse, nor is it required in any way. But 'identity' /could be realized/ as a self-relation, which is /possible/ even at the lowest level. That doesn't rule out richer, more nuanced and even quite different implementations of 'identity' emerging at higher-order scales of complexity.

* From Subjective Experience to Shared Reality

Epistemological methods -- how a Process comes to know and validate information -- are not just a means to an end (understanding a pre-existing, independent reality) but are fundamentally what constitutes reality itself. The boundaries between epistemology and ontology blur, and I think they must when we follow an approach that relies on interacting Processes who co-evolve.

At first glance, this looks as it may end up in [[https://en.wikipedia.org/wiki/Factual_relativism][factual relativism]], which it actually is, but present only at a very fundamental Scale. But the idea here is that emergent complexity can stabilize facts at higher Scales through evolutionary processes, meaning when selective criteria, applied by certain Processes get hold on other Processes (resp. their sub-Processes at multiple Scales).

