blog/metaphysics.protoverse.project.html
<div id="outline-container-org7f44ca6" class="outline-4">
<h4 id="org7f44ca6"><a href="#org7f44ca6">Baseline or Reference</a></h4>
<div class="outline-text-4" id="text-org7f44ca6">
<p>
Due to the lack of an objective reference, the nearest reasonable candidate for a baseline seems to use the notion of &rsquo;self&rsquo;. In this view, the deviation from &rsquo;self&rsquo; could become the reference for registering change [better ideas?].<br>
</p>

<p>
&rsquo;Self&rsquo; must be built from a continuous Process then, which is influenced by Experiences, requiring self-identity to be an ongoing, dynamic process rather than a fixed, unchanging property. So how could we create an abstract notion of &rsquo;self&rsquo; at a very low level?<br>
</p>

<p>
A model of &rsquo;self&rsquo; could be built from a loop by making Processes fundamentally recursive. That paves the way for preserving past states in a continually updated fashion. Recursion can enable feedback, self-adjusting behaviors, keeping state and even various degrees of &rsquo;learning&rsquo;. Recursion could also be a preliminary step towards increasingly complex models of &rsquo;self&rsquo; and its interactions with other Processes.<br>
</p>

<p>
Further, it could make sense to introduce a notion of &rsquo;decay&rsquo; into the recursion, so that the impact of recursive input decreases the further down the recursion chain. This is alike to what we recognize in certain biological and in psychological processes – e.g. when remembrance often favors more recent experiences over older ones when guiding future behavior (recency bias).<br>
</p>

<p>
Not only may the influence of previous Experience decrease as per the decay principle, but also the precision of those past experiences might be degraded — they may become less orderly and more uncertain. It touches in some aspects the concept of <i>entropy</i>.<br>
</p>

<p>
However, the idea of decay smells very bolted-on, and I&rsquo;m not happy with this ad-hoc <i>implementation</i> &ldquo;let there be decay!&rdquo;. As I will have to think really hard about entropy sooner than later, that particular idea of decay for no other than practical reasons may not the be-all and end-all of wisdom.<br>
</p>

<p>
What does all that mean for the Protoverse model?<br>
</p>
</div>
</div>
<div id="outline-container-org00d38c9" class="outline-4">
<h4 id="org00d38c9"><a href="#org00d38c9">Inherent Uncertainty</a></h4>
<div class="outline-text-4" id="text-org00d38c9">
<p>
The concept of &ldquo;equality&rdquo; (necessary to register difference), is fundamentally an approximation (<a href="https://en.wikipedia.org/wiki/Indeterminacy_(philosophy)#Approximation_versus_equality">I just found out that Nietzsche discovered that too</a>), and therefore introduces uncertainty. This may be a way how the Protoverse could give rise to ontic uncertainty at its lowest level — within the primitive interactions that are primarily concerned about registering difference.<br>
</p>

<p>
This uncertainty makes the entire system fundamentally non-deterministic. From that follows that all kinds of things that we might like to describe as discrete entities (&ldquo;objects&rdquo; or &ldquo;particles&rdquo;) are naturally approximations.<br>
</p>

<p>
It further implies that there&rsquo;s would be no need to include explicit, bolted-on randomness in the Protoverse model. Redefining the meaning of <i>Equality</i> itself would have to happen on the level of logic, and that also means a departure from <i>classical logic</i>.<br>
</p>

<p>
I don&rsquo;t know if it&rsquo;s neccessary or sensible to augment (or even replace) classical logic in order to build this quantum-like, probablistic resp. non-deterministic system. There are <i>propability theory</i> and the paradigms <i>propablistic programming</i> and <i>non-deterministic programming</i> (I&rsquo;m entirely unfamiliar with both), and these seem to work without touching the underlying logic.<br>
</p>

<p>
However, it feels more intuitive to me (haha!) to operate on the logic level &#x2013; maybe it make sense to adopt <i>fuzzy logic</i>. And while we&rsquo;re at it, we could also ditch the &ldquo;Law of the excluded middle&rdquo;! I&rsquo;ve always been suspicious of it and could never accept it.<br>
</p>

<p>
I don&rsquo;t object Planck&rsquo;s idea of the quantization in quantum mechanics, but that apparent quantization might be a phenomenon that appears due to discretization (for whatever reason) as an effect of the <i>approximation</i> that I mentioned before &#x2013; well, if this actually happens in our universe. Could this unsharpness then provide an understanding of quantum uncertainty?<br>
</p>

<p>
Ok, I&rsquo;m probably mistaken &#x2013; but even if that&rsquo;s just bullshit, it leaves the impression that <i>quantum uncertainty may be not that weird</i> actually (and could be understood intuitively, instead of accepting it at face value); and secondly, this concept might actually work as a computational substrate that shares some commonalities with quantum mechanics.<br>
</p>

<p>
Approximation (and uncertainty) within our universe might be a broadly misunderstood part of nature, rooted in the mistaken assumption that &ldquo;precision&rdquo; must be somehow &ldquo;prior&rdquo;, &ldquo;superior&rdquo; or &ldquo;perfect&rdquo; (looking at you, Plato and Descartes). Does it come from forcing the object-abstraction onto <i>everything</i>, just because the cognitive heuristic that builds objects form observed patterns feels so intuitive?<br>
</p>

<p>
Maybe we could <i>intuitively understand</i> quamtum mechanics (things like the uncertainty principle and particle-wave &ldquo;duality&rsquo;&rdquo;) and not merely accept it at face value, if we shift our perspective from a substantial-materialist (objects, particles, inherent properties) to process-relational worldview (processes, relations, participatory)?<br>
</p>

<p>
<b>TL;DR</b><br>
There are no particles, because they would be still (abstract) objects, which are merely approximations (unsharp, uncertain), resulting from a heuristic (applied by an &ldquo;observer&rdquo;) that builds the abstractions &rsquo;object&rsquo; (and other fluff) which are incomplete and distorted descriptions of the underlying processes and relations. Give up on &ldquo;building blocks&rdquo;!<br>
</p>
</div>
</div>
<div id="outline-container-org84bee3e" class="outline-4">
<h4 id="org84bee3e"><a href="#org84bee3e">Identity</a></h4>
<div class="outline-text-4" id="text-org84bee3e">
<p>
&rsquo;Idenity&rsquo; within this context means the <a href="https://en.wikipedia.org/wiki/Identity_(philosophy)">self-relation as in philosophy</a>, <i>not</i> the concept of &rsquo;Identity&rsquo; as in logic (that one I call &rsquo;Equality&rsquo; with capital &rsquo;E&rsquo;, because it&rsquo;s a technical term and works differently from classic logic).<br>
</p>

<p>
With &rsquo;identity&rsquo; being nothing prior or special, everything that applies to generic properties also applies to &rsquo;identity&rsquo;. What I particularly want to emphasize at this point, is that &rsquo;idenity&rsquo;, would not be stable or static at all.<br>
</p>

<p>
In fact, there is no inherent or pre-defined concept of &rsquo;identity&rsquo; within the Protoverse, nor is it required in any way. But &rsquo;identity&rsquo; <i>could be realized</i> as a self-relation, which is <i>possible</i> even at the lowest level. That doesn&rsquo;t rule out richer, more nuanced and even quite different implementations of &rsquo;identity&rsquo; emerging at higher-order scales of complexity.<br>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaac7295" class="outline-2">
<h2 id="orgaac7295"><a href="#orgaac7295">From Subjective Experience to Shared Reality</a></h2>
<div class="outline-text-2" id="text-orgaac7295">
<p>
Epistemological methods &#x2013; how a Process comes to know and validate information &#x2013; are not just a means to an end (understanding a pre-existing, independent reality) but are fundamentally what constitutes reality itself. The boundaries between epistemology and ontology blur, and I think they must when we follow an approach that relies on interacting Processes who co-evolve.<br>
</p>

<p>
At first glance, this looks as it may end up in <a href="https://en.wikipedia.org/wiki/Factual_relativism">factual relativism</a>, which it actually is, but present only at a very fundamental Scale. But the idea here is that emergent complexity can stabilize facts at higher Scales through evolutionary processes, meaning when selective criteria, applied by certain Processes get hold on other Processes (resp. their sub-Processes at multiple Scales).<br>
</p>
</div>
