blog/metaphysics.protoverse.project.org
** Access to Information

While all systems are generally open in one way or another, we encounter various models of scope who determine what information can be accessed, under what circumstances and to what extend; there's also a plethora of interfaces that determine what interactions are possible.

#+begin_index
- *Scope* (the contextual and relational boundaries within which processes are examined, defined by their levels of complexity, interconnections, and relational dimensions): In darwinian evolution, there are tendencies both to escalate the scope of access (ultimately interaction); e.g. resulting in improved resource acquisition, reproductive strategies, or environmental sensing -- as well as to limit it; e.g. reduced energy expenditure, avoiding predation, or preventing dilution of a successful gene pool.

- *Interfaces* (the dynamic points of interaction and communication methods between processes, encompassing the mechanisms through which processes exchange information and co-evolve.): Natural systems also operate on various scales, from microscopic to cosmic, and interactions across scales are not only possible, but seem crucial for open-endedness. However, there are natural limits to these interactions. The concept of hierarchical organization is pertinent; it imposes structural constraints on how elements within one level interact with those at another. This arrangement can be seen in everything from the cellular organization within an organism to ecological hierarchies.
#+end_index

*** Towards Evolving Scope and Interface

Processes in the Protoverse are not distinct from the reality they experience; instead, they're active participants creating and shaping it. The characteristics of experiencing reality will corelate with the intricacies of the immediate environment -- the predominantly relevant nested scales with which certain Processes have co-evolved.

Which patterns Processes may experience, how, and to make sense of them, will eventually depend on co-evolving factors -- they could be described analogous terms as "perspective", "zoom-factor" or "ability". 

The scope and the kind of interface exposed by a Process can evolve, affecting how the specific Process interacts within the Protoverse. The possibility of gradual escalation of scope, as well as gradual restriction therefore seems quite important.

** How can Processes Account for Shared Realities?

Well, can /we/? And with whom, exactly? What's your shared reality with a Thiobacillus — "Sulphur is yummy"?

Humans share their subjective realities only with a narrow class of species, with which they /can relate to/; to the highest degree normally with other humans. If we wander off the trampled path just a little and consider other species, the degrees of shared reality are rapidly dwindling.

How can Processes agree upon beliefs or even construct knowledge?

It might turn out beneficial for certain processes to reach "common ground" by re-evaluating between agreement and disagreement. Hence, /striving for consensus might be one of the drivers for Evolution ("selective pressure") within the Protoverse/, as a common ground might turn out to be beneficial in multiple ways.

Reality, as we humans experience it, is neither socially constructed, fundamentally physical, restricted to "matter", nor does it exists only in the mind -- it's all of that together and more, and it's dynamic on top of that. Boundaries are not fixed but relational, and "all is connected" in so far that process-relational ontology (thanks to its "monistic pluralism") can model the required compatibility across Nested Scales Of Complexity.

So, /everything/ can be /real/, possible (probablistic) and true, but within specific relational context. Even the concept of an 'object' is fine, just not at every scale: The crux is that not all offsprings of higher-level consensual realities (which includes formal systems and logics) can be readily applied on every other Scale (pluralistic), because that /could/ (not 'must'!) result in ignoring their contextual/relational "roots", so that their validity looses hold.

Such violations (e.g. inappropriate abstractions -- like the concepts of 'object' or 'particle' applied pervasively) are often hard to detect because their validity /depends/ on many sources. "Roots" is a not-so-bad word to put it, instead of "foundation" -- because it gives us the more accurate picture of multiple anchors in many directions, rather than a single flat lump of concrete serving as the source(s) of validity.

Systems of Processes and their relations across a span of certain Scales /can be discovered/ by others, even though the overall model is primary constructivist. 'Objectivity' depends on the relationships and interactions between processes, rather than being a universal viewpoint removed from all perspective. Some aspects:

- The classical notion of objectivity is replaced with a more nuanced concept of 'intersubjectivity'. The 'subjective' refers to the experience or perspective of a given Process, while 'inter' refers to the shared aspects of reality that emerge from the interactions between multiple Processes. Note that what's considered objective is no fixed truth, but can change. This viewpoint further acknowledges perspectives and biases as constituent elements rather than viewing them as distortions to be eliminated.

- Objectivity emerges from relations between processes, rather than existing independently of any perspective: The seeming consistency and coherence of patterns across different perspectives might manifest in threshold-delimited spectra arising from approximation (or discretization) due to the inherent lack of absolute equality, so that a relational objective fact maintains its structure or function across various Process interactions (observational invariants).

- Arising from the confluence of Processes, objectivity is a reflection of robust patterns. These patterns can be seen as objective to the extent that they are stable within the context of the system's evolutionary dynamics. This is strongly related to "universals" and consensual reality. From an evolutionary perspective, certain Patterns or may be 'selected' for their resilience or adaptiveness within the system, thereby achieving a kind of evolutionary objectivity. These features are objective insofar as they consistently contribute to the loop of evolutionary processes.

