blog/metaphysics.protoverse.project.html
<div id="outline-container-org4c362e2" class="outline-3">
<h3 id="org4c362e2"><a href="#org4c362e2">Access to Information</a></h3>
<div class="outline-text-3" id="text-org4c362e2">
<p>
While all systems are generally open in one way or another, we encounter various models of scope who determine what information can be accessed, under what circumstances and to what extend; there&rsquo;s also a plethora of interfaces that determine what interactions are possible.<br>
</p>

<div class="index" id="org2943b5a">
<ul class="org-ul">
<li><b>Scope</b> (the contextual and relational boundaries within which processes are examined, defined by their levels of complexity, interconnections, and relational dimensions): In darwinian evolution, there are tendencies both to escalate the scope of access (ultimately interaction); e.g. resulting in improved resource acquisition, reproductive strategies, or environmental sensing &#x2013; as well as to limit it; e.g. reduced energy expenditure, avoiding predation, or preventing dilution of a successful gene pool.<br></li>

<li><b>Interfaces</b> (the dynamic points of interaction and communication methods between processes, encompassing the mechanisms through which processes exchange information and co-evolve.): Natural systems also operate on various scales, from microscopic to cosmic, and interactions across scales are not only possible, but seem crucial for open-endedness. However, there are natural limits to these interactions. The concept of hierarchical organization is pertinent; it imposes structural constraints on how elements within one level interact with those at another. This arrangement can be seen in everything from the cellular organization within an organism to ecological hierarchies.<br></li>
</ul>

</div>
</div>
<div id="outline-container-org7dc05c4" class="outline-4">
<h4 id="org7dc05c4"><a href="#org7dc05c4">Towards Evolving Scope and Interface</a></h4>
<div class="outline-text-4" id="text-org7dc05c4">
<p>
Processes in the Protoverse are not distinct from the reality they experience; instead, they&rsquo;re active participants creating and shaping it. The characteristics of experiencing reality will corelate with the intricacies of the immediate environment &#x2013; the predominantly relevant nested scales with which certain Processes have co-evolved.<br>
</p>

<p>
Which patterns Processes may experience, how, and to make sense of them, will eventually depend on co-evolving factors &#x2013; they could be described analogous terms as &ldquo;perspective&rdquo;, &ldquo;zoom-factor&rdquo; or &ldquo;ability&rdquo;.<br>
</p>

<p>
The scope and the kind of interface exposed by a Process can evolve, affecting how the specific Process interacts within the Protoverse. The possibility of gradual escalation of scope, as well as gradual restriction therefore seems quite important.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org97bdaa6" class="outline-3">
<h3 id="org97bdaa6"><a href="#org97bdaa6">How can Processes Account for Shared Realities?</a></h3>
<div class="outline-text-3" id="text-org97bdaa6">
<p>
Well, can <i>we</i>? And with whom, exactly? What&rsquo;s your shared reality with a Thiobacillus — &ldquo;Sulphur is yummy&rdquo;?<br>
</p>

<p>
Humans share their subjective realities only with a narrow class of species, with which they <i>can relate to</i>; to the highest degree normally with other humans. If we wander off the trampled path just a little and consider other species, the degrees of shared reality are rapidly dwindling.<br>
</p>

<p>
How can Processes agree upon beliefs or even construct knowledge?<br>
</p>

<p>
It might turn out beneficial for certain processes to reach &ldquo;common ground&rdquo; by re-evaluating between agreement and disagreement. Hence, <i>striving for consensus might be one of the drivers for Evolution (&ldquo;selective pressure&rdquo;) within the Protoverse</i>, as a common ground might turn out to be beneficial in multiple ways.<br>
</p>

<p>
Reality, as we humans experience it, is neither socially constructed, fundamentally physical, restricted to &ldquo;matter&rdquo;, nor does it exists only in the mind &#x2013; it&rsquo;s all of that together and more, and it&rsquo;s dynamic on top of that. Boundaries are not fixed but relational, and &ldquo;all is connected&rdquo; in so far that process-relational ontology (thanks to its &ldquo;monistic pluralism&rdquo;) can model the required compatibility across Nested Scales Of Complexity.<br>
</p>

<p>
So, <i>everything</i> can be <i>real</i>, possible (probablistic) and true, but within specific relational context. Even the concept of an &rsquo;object&rsquo; is fine, just not at every scale: The crux is that not all offsprings of higher-level consensual realities (which includes formal systems and logics) can be readily applied on every other Scale (pluralistic), because that <i>could</i> (not &rsquo;must&rsquo;!) result in ignoring their contextual/relational &ldquo;roots&rdquo;, so that their validity looses hold.<br>
</p>

<p>
Such violations (e.g. inappropriate abstractions &#x2013; like the concepts of &rsquo;object&rsquo; or &rsquo;particle&rsquo; applied pervasively) are often hard to detect because their validity <i>depends</i> on many sources. &ldquo;Roots&rdquo; is a not-so-bad word to put it, instead of &ldquo;foundation&rdquo; &#x2013; because it gives us the more accurate picture of multiple anchors in many directions, rather than a single flat lump of concrete serving as the source(s) of validity.<br>
</p>

<p>
Systems of Processes and their relations across a span of certain Scales <i>can be discovered</i> by others, even though the overall model is primary constructivist. &rsquo;Objectivity&rsquo; depends on the relationships and interactions between processes, rather than being a universal viewpoint removed from all perspective. Some aspects:<br>
</p>

<ul class="org-ul">
<li>The classical notion of objectivity is replaced with a more nuanced concept of &rsquo;intersubjectivity&rsquo;. The &rsquo;subjective&rsquo; refers to the experience or perspective of a given Process, while &rsquo;inter&rsquo; refers to the shared aspects of reality that emerge from the interactions between multiple Processes. Note that what&rsquo;s considered objective is no fixed truth, but can change. This viewpoint further acknowledges perspectives and biases as constituent elements rather than viewing them as distortions to be eliminated.<br></li>

<li>Objectivity emerges from relations between processes, rather than existing independently of any perspective: The seeming consistency and coherence of patterns across different perspectives might manifest in threshold-delimited spectra arising from approximation (or discretization) due to the inherent lack of absolute equality, so that a relational objective fact maintains its structure or function across various Process interactions (observational invariants).<br></li>

<li>Arising from the confluence of Processes, objectivity is a reflection of robust patterns. These patterns can be seen as objective to the extent that they are stable within the context of the system&rsquo;s evolutionary dynamics. This is strongly related to &ldquo;universals&rdquo; and consensual reality. From an evolutionary perspective, certain Patterns or may be &rsquo;selected&rsquo; for their resilience or adaptiveness within the system, thereby achieving a kind of evolutionary objectivity. These features are objective insofar as they consistently contribute to the loop of evolutionary processes.<br></li>
</ul>
</div>
