blog/metaphysics.protoverse.project.org
*** Models are more deeply Nested Scales Of Complexity

A given system (which is a bunch of interrelated Processes) can be re-constructed by another Process to a certain degree; just not "perfectly": to what extend such a re-construction is possible, depends on:

- The epistemic scope of the Process;
- The interfaces (and therefore the possible interactions) of the system to be re-constructed;
- That there cannot be two Processes absolutely equal;

Re-constructing of a system of processes gives naturally rise to a new Nested Scale Of Complexity -- it's like if we develop and describe a model of something we've discovered in nature. For a model to be either regarded as "static" or "dynamic" is merely a matter of description.

Such a new scale in turn becomes a fully legit part of reality, independent of (our made-up) "classic" categorizations such as "abstract" or "concrete", because these categories don't apply per se.

* Navigating Uncertainty

In a universe where uncertainty is inherent, a form of prediction certainly would be an advantageous skill. The concept of prediction is quite high-level and involves the capability to construct a model of the situation under inquiry. Having such a model significantly minimalizes the exposition to critical failure for the actual entity through exploration of the model via assumption, test and transfer, instead of the actual environment upon which its own viability depends on.

To get something akin to prediction, but as low-level as possible, we would do good if we remove the need for an acting individual, model-building, intention (mindless stuff going on here!). But then we wouldn't have "prediction" any longer, but arrive at evolution in the Darwinian sense.

While prediction and evolution are certainly not the same, both constitue feedback loops, are suitable algorithms for navigating an uncertain/probablistic environment -- both are implementing feedback loops.

* Universal Darwinism

Even though first recognized at the biological Scale (and hence related to it) -- processes described by Darwinian Evolution seem to operate on various Scales apparent in our universe. Evolution may not only be a process operating at one Scale (the biological) or even propagates across certain Scales, but /creates/ all these Scales in the first place.

Of course, the specifics of the evolutionary process(es) -- their "implementations" -- differ vastly across the Scales, contingent upon the peculiarities of each respective Scale -- loosely formulated: evolution creates it's "inner workings" from whatever "material" is "accessible" at the scales it is operating: "genes" at biological scales and whatever "material" there is (and will be) available at other Scales.

*Same same but different:* Darwin-style evolution is a shapeshifter hiding in plain sight, because the prevalent materialist-substantial understanding and the related concepts of "identity" and "change" obstruct the focus on what's important.

The notion "Universal Darwinism" may be an essential principle of the universe, and if there could be a "Theory Of Everything" (TOE) that can explains phenomena at all scales, this might be the best candidate.

But even if Universal Darwinism is "the TOE", we might be unable to reproduce all or any phenomena present in our universe, not just because of some arbitrary limits, but because of over-sensitivity to initial conditions (and maybe non-determinism): emerging "laws" (observed constants) may turn out differently or remain entirely absent, even if we get it right, up and running.

** Reception of Universal Darwinism

The application of evolutionary concepts to non-biological systems is [[https://en.m.wikipedia.org/wiki/Universal_Darwinism][widely recognized within science]]. However, there is no comprehensive generalization of Darwinian evolution yet. Critics argue that Darwinian mechanisms cannot be directly applied to non-biological systems or that doing so oversimplifies the complexities and unique features of different domains.

There are many reasons for this skepticism (organizational, political, ideological, emotional, traditional), but I would like to focus on two main issues:

*** Misinterpretation of Implementation Details
I believe this skepticism primarily arises from mistaking the implementation details of Darwinian evolutionary processes for the processes themselves. This is understandable, as the implementation details of evolutionary processes are vastly diverse across various domains and are themselves subject to evolution. However, if we would treat these processes as [[https://en.wikipedia.org/wiki/Homomorphism][homomorphisms]] and describe them by their algorithmic commonalities and efficacy, we could apply these principles across diverse domains while respecting the unique features of each domain.

*** Lack of an Integrative Multi-Scale Framework
The second major issue is the absence of an integrative framework. When contemplating the dynamic structures in our universe, we often categorize and assign hierarchies —- such as physical domain, biological organisms, the mind, society, informational ecosystems, and so on. These categories appear significant to us, but all these distinctions are somewhat arbitrary because they are based on intuitive perception, what seems obvious and meaningful, and pragmatic considerations, leading to inconsitent hierarchies.

Overcoming these two main issues could help in better applying and accepting Universal Darwinism across various non-biological systems. Let's consider both in detail:

** Algorithmic Nature of Evolution

In this context, "algorithmic" refers not to a mechanistic sequence of steps, but to an underlying informational dynamism that guides the evolution of systems in a generic sense.

This dynamism is substrate-independent, meaning that the specifics of the system's components -- whether they are molecules, biological cells, or abstract Processes in a computational universe -- are less important than the general patterns of change that drive evolution within these systems.

Evolution in the Darwinian sense is a [[https://en.m.wikipedia.org/wiki/Self-perpetuation][self-sustaining]] and [[https://en.m.wikipedia.org/wiki/Positive_feedback][self-reinforcing]] loop (akin to a "virtuous cycle"). This loop consists of interdependent stages, where each stage circularly depends on the others. Each repetition creates and reinforces the conditions for the other stages to function, and so on. Hence, it is working /recursively/ at multiple scales.

*** General Principles of Evolutionary Dynamics

What are the necessary principles of Darwinian Evolution? I'm using generic terms to minimize substrate-specific connotations (e.g., replacing "inheritance" with "Retention"):

