blog/metaphysics.protoverse.project.html
<div id="outline-container-orgbfca3a2" class="outline-4">
<h4 id="orgbfca3a2"><a href="#orgbfca3a2">Models are more deeply Nested Scales Of Complexity</a></h4>
<div class="outline-text-4" id="text-orgbfca3a2">
<p>
A given system (which is a bunch of interrelated Processes) can be re-constructed by another Process to a certain degree; just not &ldquo;perfectly&rdquo;: to what extend such a re-construction is possible, depends on:<br>
</p>

<ul class="org-ul">
<li>The epistemic scope of the Process;<br></li>
<li>The interfaces (and therefore the possible interactions) of the system to be re-constructed;<br></li>
<li>That there cannot be two Processes absolutely equal;<br></li>
</ul>

<p>
Re-constructing of a system of processes gives naturally rise to a new Nested Scale Of Complexity &#x2013; it&rsquo;s like if we develop and describe a model of something we&rsquo;ve discovered in nature. For a model to be either regarded as &ldquo;static&rdquo; or &ldquo;dynamic&rdquo; is merely a matter of description.<br>
</p>

<p>
Such a new scale in turn becomes a fully legit part of reality, independent of (our made-up) &ldquo;classic&rdquo; categorizations such as &ldquo;abstract&rdquo; or &ldquo;concrete&rdquo;, because these categories don&rsquo;t apply per se.<br>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org1cd7bd9" class="outline-2">
<h2 id="org1cd7bd9"><a href="#org1cd7bd9">Navigating Uncertainty</a></h2>
<div class="outline-text-2" id="text-org1cd7bd9">
<p>
In a universe where uncertainty is inherent, a form of prediction certainly would be an advantageous skill. The concept of prediction is quite high-level and involves the capability to construct a model of the situation under inquiry. Having such a model significantly minimalizes the exposition to critical failure for the actual entity through exploration of the model via assumption, test and transfer, instead of the actual environment upon which its own viability depends on.<br>
</p>

<p>
To get something akin to prediction, but as low-level as possible, we would do good if we remove the need for an acting individual, model-building, intention (mindless stuff going on here!). But then we wouldn&rsquo;t have &ldquo;prediction&rdquo; any longer, but arrive at evolution in the Darwinian sense.<br>
</p>

<p>
While prediction and evolution are certainly not the same, both constitue feedback loops, are suitable algorithms for navigating an uncertain/probablistic environment &#x2013; both are implementing feedback loops.<br>
</p>
</div>
</div>
<div id="outline-container-org04c7019" class="outline-2">
<h2 id="org04c7019"><a href="#org04c7019">Universal Darwinism</a></h2>
<div class="outline-text-2" id="text-org04c7019">
<p>
Even though first recognized at the biological Scale (and hence related to it) &#x2013; processes described by Darwinian Evolution seem to operate on various Scales apparent in our universe. Evolution may not only be a process operating at one Scale (the biological) or even propagates across certain Scales, but <i>creates</i> all these Scales in the first place.<br>
</p>

<p>
Of course, the specifics of the evolutionary process(es) &#x2013; their &ldquo;implementations&rdquo; &#x2013; differ vastly across the Scales, contingent upon the peculiarities of each respective Scale &#x2013; loosely formulated: evolution creates it&rsquo;s &ldquo;inner workings&rdquo; from whatever &ldquo;material&rdquo; is &ldquo;accessible&rdquo; at the scales it is operating: &ldquo;genes&rdquo; at biological scales and whatever &ldquo;material&rdquo; there is (and will be) available at other Scales.<br>
</p>

<p>
<b>Same same but different:</b> Darwin-style evolution is a shapeshifter hiding in plain sight, because the prevalent materialist-substantial understanding and the related concepts of &ldquo;identity&rdquo; and &ldquo;change&rdquo; obstruct the focus on what&rsquo;s important.<br>
</p>

<p>
The notion &ldquo;Universal Darwinism&rdquo; may be an essential principle of the universe, and if there could be a &ldquo;Theory Of Everything&rdquo; (TOE) that can explains phenomena at all scales, this might be the best candidate.<br>
</p>

<p>
But even if Universal Darwinism is &ldquo;the TOE&rdquo;, we might be unable to reproduce all or any phenomena present in our universe, not just because of some arbitrary limits, but because of over-sensitivity to initial conditions (and maybe non-determinism): emerging &ldquo;laws&rdquo; (observed constants) may turn out differently or remain entirely absent, even if we get it right, up and running.<br>
</p>
</div>
<div id="outline-container-org159c068" class="outline-3">
<h3 id="org159c068"><a href="#org159c068">Reception of Universal Darwinism</a></h3>
<div class="outline-text-3" id="text-org159c068">
<p>
The application of evolutionary concepts to non-biological systems is <a href="https://en.m.wikipedia.org/wiki/Universal_Darwinism">widely recognized within science</a>. However, there is no comprehensive generalization of Darwinian evolution yet. Critics argue that Darwinian mechanisms cannot be directly applied to non-biological systems or that doing so oversimplifies the complexities and unique features of different domains.<br>
</p>

<p>
There are many reasons for this skepticism (organizational, political, ideological, emotional, traditional), but I would like to focus on two main issues:<br>
</p>
</div>
<div id="outline-container-orgf603de5" class="outline-4">
<h4 id="orgf603de5"><a href="#orgf603de5">Misinterpretation of Implementation Details</a></h4>
<div class="outline-text-4" id="text-orgf603de5">
<p>
I believe this skepticism primarily arises from mistaking the implementation details of Darwinian evolutionary processes for the processes themselves. This is understandable, as the implementation details of evolutionary processes are vastly diverse across various domains and are themselves subject to evolution. However, if we would treat these processes as <a href="https://en.wikipedia.org/wiki/Homomorphism">homomorphisms</a> and describe them by their algorithmic commonalities and efficacy, we could apply these principles across diverse domains while respecting the unique features of each domain.<br>
</p>
</div>
</div>
<div id="outline-container-orgbc5b2c1" class="outline-4">
<h4 id="orgbc5b2c1"><a href="#orgbc5b2c1">Lack of an Integrative Multi-Scale Framework</a></h4>
<div class="outline-text-4" id="text-orgbc5b2c1">
<p>
The second major issue is the absence of an integrative framework. When contemplating the dynamic structures in our universe, we often categorize and assign hierarchies —- such as physical domain, biological organisms, the mind, society, informational ecosystems, and so on. These categories appear significant to us, but all these distinctions are somewhat arbitrary because they are based on intuitive perception, what seems obvious and meaningful, and pragmatic considerations, leading to inconsitent hierarchies.<br>
</p>

<p>
Overcoming these two main issues could help in better applying and accepting Universal Darwinism across various non-biological systems. Let&rsquo;s consider both in detail:<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org3174615" class="outline-3">
<h3 id="org3174615"><a href="#org3174615">Algorithmic Nature of Evolution</a></h3>
<div class="outline-text-3" id="text-org3174615">
<p>
In this context, &ldquo;algorithmic&rdquo; refers not to a mechanistic sequence of steps, but to an underlying informational dynamism that guides the evolution of systems in a generic sense.<br>
</p>

<p>
This dynamism is substrate-independent, meaning that the specifics of the system&rsquo;s components &#x2013; whether they are molecules, biological cells, or abstract Processes in a computational universe &#x2013; are less important than the general patterns of change that drive evolution within these systems.<br>
</p>

<p>
Evolution in the Darwinian sense is a <a href="https://en.m.wikipedia.org/wiki/Self-perpetuation">self-sustaining</a> and <a href="https://en.m.wikipedia.org/wiki/Positive_feedback">self-reinforcing</a> loop (akin to a &ldquo;virtuous cycle&rdquo;). This loop consists of interdependent stages, where each stage circularly depends on the others. Each repetition creates and reinforces the conditions for the other stages to function, and so on. Hence, it is working <i>recursively</i> at multiple scales.<br>
</p>
</div>
<div id="outline-container-orgf0e7873" class="outline-4">
<h4 id="orgf0e7873"><a href="#orgf0e7873">General Principles of Evolutionary Dynamics</a></h4>
<div class="outline-text-4" id="text-orgf0e7873">
<p>
What are the necessary principles of Darwinian Evolution? I&rsquo;m using generic terms to minimize substrate-specific connotations (e.g., replacing &ldquo;inheritance&rdquo; with &ldquo;Retention&rdquo;):<br>
</p>
</div>
