blog/metaphysics.protoverse.project.org
**** Variety
Variety is inevitable, as there can never be perfect equality. It is intrinsic to complex systems and not merely a collection of deviations.

**** Repetition
Repetition is not the reproduction of the same with errors, but the production of successive new states through iteration. It facilitates both the generation of Variety and suppression of Variety (leading to Retention) via the application of selective criteria.

Evolutionary dynamics do not need to produce variations directly; it suffices if they result in a system-wide increase in Variety. Various iterative Processes can fulfill this role; even if they are less effective than self-replicators, they may be "good enough", and the only implementation available at certain Nested Scales of Complexity.

**** Selection
Repetition applies selective criteria leading to change (predominantly increasing Variety) and preventing from change (Retention). It is important to note that the application of selective criteria is not symmetric in both directions; picture this as leading to change as +1; preventing change as 0 (but not -1). Selective criteria themselves are Processes (primitive or aggregate). As systems evolve, the criteria for selection also evolve, leading to meta-evolutionary dynamics.

Preference is pervasive, arising through various criteria (Processes) that act as filters or enhancers. With Variety and interaction, selection is inevitable too.

**** Retention
Retention occurs when selective criteria preventing change are repeatedly applied. Retention stabilizes certain configurations, counteracting the system's tendency towards entropy. Retention does not merely preserve states but also organize and structure information.

Retention of information, a certain state, configuration or dynamism can happen through various mechanisms, that do not neccessarily have to qualify as self-replicators -- these are just evolved higher-order implementations of Retention. Self-replicators are catalysts that initiate a transition leading to a new Nested Scale of Complexity with emergent rules/dynamics and successive exploration of new possibilities.

**** Meta-Evolution
Meta-evolution recognizes that the dynamics governing evolution can themselves evolve. This recursive adaptation, known as "the evolution of evolvability," allows for the emergence of novel implementations, strategies and mechanisms at different Nested Scales of Complexity.

*** Research Concerning The Evolution of Evolution

#+begin_index
- [[https://en.wikipedia.org/wiki/Evolvability][Evolvability]] investigates if and how /biological/ systems can evolve, and also the [[https://en.wikipedia.org/wiki/Evolvability#Evolution_of_evolvability][evolution of evolvability]]. Amongst others, the enhancement of selection has been recognized.
- Richard Dawkins has discussed in his book "The Selfish Gene" how the process of natural selection itself can select for traits that make evolution more effective.
#+end_index

** Nested Scales of Complexity

The "Nested Scales of Complexity" are no part of the Protoverse ontology, but merely a view on the structural dynamics of Processes co-evolving into higher-order Processes. Think of it as the early stage of a generalized pluralistic multi-scale framework that aims to integrate:

- Diverse rulesets, embracing pluralism
- A scalable model supporting substrate-independent open-ended evolution
- Include hierarchical and non-hierarchical relationships, including circular dependencies
- Integrate dichotomies (e.g. concrete/abstract, mind/matter, etc.)
- Connectivity across different scales
- Account for chaos

Nested Scales of Complexity allow us to acknowledge that each Scale can have their fundamentally own constitution, including constants, rules/laws -- while still maintaining compatibility and interaction with other Scales, because they are made from the "same stuff", namely Processes. In philosoper's jargon, it can be understood as a "pluralistic monism".

The "Nested Scales Of Complexity" should also help to visualize how the implementation of darwin-like evolutionary Processes can be fundamentally dependent on the constitution of each Scale (and therefore can look different from Scale to Scale), while the abstract algorithm of Darwin-style evolution -- the feedback loops based on difference, repetition, selection, retention -- not merely operates within one Scale, or propagate across various Scales, but actually creates all of them: Evolutinary Processes themselves evolve, while they co-evolve their very own and sucessive substrates they operate in.

Within this framework, I won't use terms like "domain" to refer to "the biological," nor will I use terms like "realms" or "layers". It's quite tedious to find appropriate terms that aren't loaded with preconceptions of disconnection, linear hierarchy, and static structuralism, while avoiding over-emphasizing singular aspects at the same time. For example, "Nested inter-related Computational Substrates" might convey the idea to some, but it overly emphasizes "computation" for others. Therefore, let's stick to the term "Nested Scales of Complexity" for now.

*** Interscale Connectivity

Processes as the primary abstraction (monism) ensure compatibility for interaction and influence at all Scales, but only at the level of primitive Processes. In other words, there are no closed systems, but gradually open systems.

Higher-order Processes emerge various dynamics that lead to higher-order forms of connectivity, but also prevent higher-order connectivity in other cases, leading to encapsulation or compartmentalization. It follows that all Scales could interact with all other Scales in principle, but not to the same effect.

*** Catalytic Transitions

During which evolutionary processes /create/ or /become/ their immediate environment (co-evolve their substrate/environment), Catalytic Transitions mark either gradual events or apparent leaps where evolutionary Processes emerge new Nested Scales of Complexity.

Catalytic transitions appear when a new implementation detail emerges that significantly increases velocity of search space exploration, diversity, resilence, information retention, information transfer bandwidth, or other parameters.

Catalytic Transitions don't necessarily lead to higher complexity in newly emerging Scales -- often quite the opposite. On the other side, Scales with less complexity will likely inform the creation of further Scales.

