blog/metaphysics.protoverse.project.html
<div id="outline-container-orgba0a10f" class="outline-5">
<h5 id="orgba0a10f"><a href="#orgba0a10f">Variety</a></h5>
<div class="outline-text-5" id="text-orgba0a10f">
<p>
Variety is inevitable, as there can never be perfect equality. It is intrinsic to complex systems and not merely a collection of deviations.<br>
</p>
</div>
</div>
<div id="outline-container-orgf2149e5" class="outline-5">
<h5 id="orgf2149e5"><a href="#orgf2149e5">Repetition</a></h5>
<div class="outline-text-5" id="text-orgf2149e5">
<p>
Repetition is not the reproduction of the same with errors, but the production of successive new states through iteration. It facilitates both the generation of Variety and suppression of Variety (leading to Retention) via the application of selective criteria.<br>
</p>

<p>
Evolutionary dynamics do not need to produce variations directly; it suffices if they result in a system-wide increase in Variety. Various iterative Processes can fulfill this role; even if they are less effective than self-replicators, they may be &ldquo;good enough&rdquo;, and the only implementation available at certain Nested Scales of Complexity.<br>
</p>
</div>
</div>
<div id="outline-container-orga5f8c8e" class="outline-5">
<h5 id="orga5f8c8e"><a href="#orga5f8c8e">Selection</a></h5>
<div class="outline-text-5" id="text-orga5f8c8e">
<p>
Repetition applies selective criteria leading to change (predominantly increasing Variety) and preventing from change (Retention). It is important to note that the application of selective criteria is not symmetric in both directions; picture this as leading to change as +1; preventing change as 0 (but not -1). Selective criteria themselves are Processes (primitive or aggregate). As systems evolve, the criteria for selection also evolve, leading to meta-evolutionary dynamics.<br>
</p>

<p>
Preference is pervasive, arising through various criteria (Processes) that act as filters or enhancers. With Variety and interaction, selection is inevitable too.<br>
</p>
</div>
</div>
<div id="outline-container-orgfafb54c" class="outline-5">
<h5 id="orgfafb54c"><a href="#orgfafb54c">Retention</a></h5>
<div class="outline-text-5" id="text-orgfafb54c">
<p>
Retention occurs when selective criteria preventing change are repeatedly applied. Retention stabilizes certain configurations, counteracting the system&rsquo;s tendency towards entropy. Retention does not merely preserve states but also organize and structure information.<br>
</p>

<p>
Retention of information, a certain state, configuration or dynamism can happen through various mechanisms, that do not neccessarily have to qualify as self-replicators &#x2013; these are just evolved higher-order implementations of Retention. Self-replicators are catalysts that initiate a transition leading to a new Nested Scale of Complexity with emergent rules/dynamics and successive exploration of new possibilities.<br>
</p>
</div>
</div>
<div id="outline-container-org6e616e0" class="outline-5">
<h5 id="org6e616e0"><a href="#org6e616e0">Meta-Evolution</a></h5>
<div class="outline-text-5" id="text-org6e616e0">
<p>
Meta-evolution recognizes that the dynamics governing evolution can themselves evolve. This recursive adaptation, known as &ldquo;the evolution of evolvability,&rdquo; allows for the emergence of novel implementations, strategies and mechanisms at different Nested Scales of Complexity.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org6b76b9a" class="outline-4">
<h4 id="org6b76b9a"><a href="#org6b76b9a">Research Concerning The Evolution of Evolution</a></h4>
<div class="outline-text-4" id="text-org6b76b9a">
<div class="index" id="org7e88db6">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Evolvability">Evolvability</a> investigates if and how <i>biological</i> systems can evolve, and also the <a href="https://en.wikipedia.org/wiki/Evolvability#Evolution_of_evolvability">evolution of evolvability</a>. Amongst others, the enhancement of selection has been recognized.<br></li>
<li>Richard Dawkins has discussed in his book &ldquo;The Selfish Gene&rdquo; how the process of natural selection itself can select for traits that make evolution more effective.<br></li>
</ul>

</div>
</div>
</div>
</div>
<div id="outline-container-org12b3903" class="outline-3">
<h3 id="org12b3903"><a href="#org12b3903">Nested Scales of Complexity</a></h3>
<div class="outline-text-3" id="text-org12b3903">
<p>
The &ldquo;Nested Scales of Complexity&rdquo; are no part of the Protoverse ontology, but merely a view on the structural dynamics of Processes co-evolving into higher-order Processes. Think of it as the early stage of a generalized pluralistic multi-scale framework that aims to integrate:<br>
</p>

<ul class="org-ul">
<li>Diverse rulesets, embracing pluralism<br></li>
<li>A scalable model supporting substrate-independent open-ended evolution<br></li>
<li>Include hierarchical and non-hierarchical relationships, including circular dependencies<br></li>
<li>Integrate dichotomies (e.g. concrete/abstract, mind/matter, etc.)<br></li>
<li>Connectivity across different scales<br></li>
<li>Account for chaos<br></li>
</ul>

<p>
Nested Scales of Complexity allow us to acknowledge that each Scale can have their fundamentally own constitution, including constants, rules/laws &#x2013; while still maintaining compatibility and interaction with other Scales, because they are made from the &ldquo;same stuff&rdquo;, namely Processes. In philosoper&rsquo;s jargon, it can be understood as a &ldquo;pluralistic monism&rdquo;.<br>
</p>

<p>
The &ldquo;Nested Scales Of Complexity&rdquo; should also help to visualize how the implementation of darwin-like evolutionary Processes can be fundamentally dependent on the constitution of each Scale (and therefore can look different from Scale to Scale), while the abstract algorithm of Darwin-style evolution &#x2013; the feedback loops based on difference, repetition, selection, retention &#x2013; not merely operates within one Scale, or propagate across various Scales, but actually creates all of them: Evolutinary Processes themselves evolve, while they co-evolve their very own and sucessive substrates they operate in.<br>
</p>

<p>
Within this framework, I won&rsquo;t use terms like &ldquo;domain&rdquo; to refer to &ldquo;the biological,&rdquo; nor will I use terms like &ldquo;realms&rdquo; or &ldquo;layers&rdquo;. It&rsquo;s quite tedious to find appropriate terms that aren&rsquo;t loaded with preconceptions of disconnection, linear hierarchy, and static structuralism, while avoiding over-emphasizing singular aspects at the same time. For example, &ldquo;Nested inter-related Computational Substrates&rdquo; might convey the idea to some, but it overly emphasizes &ldquo;computation&rdquo; for others. Therefore, let&rsquo;s stick to the term &ldquo;Nested Scales of Complexity&rdquo; for now.<br>
</p>
</div>
<div id="outline-container-orgc7d6f67" class="outline-4">
<h4 id="orgc7d6f67"><a href="#orgc7d6f67">Interscale Connectivity</a></h4>
<div class="outline-text-4" id="text-orgc7d6f67">
<p>
Processes as the primary abstraction (monism) ensure compatibility for interaction and influence at all Scales, but only at the level of primitive Processes. In other words, there are no closed systems, but gradually open systems.<br>
</p>

<p>
Higher-order Processes emerge various dynamics that lead to higher-order forms of connectivity, but also prevent higher-order connectivity in other cases, leading to encapsulation or compartmentalization. It follows that all Scales could interact with all other Scales in principle, but not to the same effect.<br>
</p>
</div>
</div>
<div id="outline-container-org246b2ca" class="outline-4">
<h4 id="org246b2ca"><a href="#org246b2ca">Catalytic Transitions</a></h4>
<div class="outline-text-4" id="text-org246b2ca">
<p>
During which evolutionary processes <i>create</i> or <i>become</i> their immediate environment (co-evolve their substrate/environment), Catalytic Transitions mark either gradual events or apparent leaps where evolutionary Processes emerge new Nested Scales of Complexity.<br>
</p>

<p>
Catalytic transitions appear when a new implementation detail emerges that significantly increases velocity of search space exploration, diversity, resilence, information retention, information transfer bandwidth, or other parameters.<br>
</p>

<p>
Catalytic Transitions don&rsquo;t necessarily lead to higher complexity in newly emerging Scales &#x2013; often quite the opposite. On the other side, Scales with less complexity will likely inform the creation of further Scales.<br>
</p>
</div>
