blog/metaphysics.protoverse.project.org
**** Examples
Retrospective: a few examples of remarkable Catalytic Transitions to consider. Catalytic Transitions are characterized by emergent phenomena that introduce novelty.

- Gravity (perhaps from an evolutionary "selective pressure" (speed limit?) favoring the trait of locality?)
- Emergence of space
- Appearance of time
- Supernovae distribute [[https://en.wikipedia.org/wiki/CHNOPS][heavier elements (CHNOPS)]], enabling accumulation in planets and assemblage of complex molecules
- The rise of replicators (explosive acceleration of search space exploration via parallel processing)
- Self-replicators (increased redundancy and resilience, arms race)
- [[https://en.wikipedia.org/wiki/Eukaryote#Origin_of_eukaryotes][Eukaryogenesis]] (allows more complex cellular structures)
- Photosynthesis (increased efficiency of energy absorption from visible light, but increased oxygen levels)
- [[https://en.wikipedia.org/wiki/Evolution_of_sexual_reproduction#Advantages_of_sex_and_sexual_reproduction][Sexual reproduction]] (it's ... complicated)
- Multicellular lifeforms (increases specialization and cooperation)
- Photoreceptors and eyes (better interaction and survival strategies)
- Nervous system and brains (advanced coordination, learning and adaption)
- Evolution of consciousness (the great confusor)
- Computers
- The internet
- Artificial intelligence systems (new playground for anthropocentric fantasies)
- ... ?

**** See also:
#+begin_index
- John Maynard Smith and Eörs Szathmáry: They authored "[[https://en.wikipedia.org/wiki/The_Major_Transitions_in_Evolution][The Major Transitions in Evolution]]", which focuses on phase transitions in the evolution of life on Earth. They outline several significant transitions such as the origin of chromosomes, eukaryotes, sex, multicellularity, and the development of societies in certain animals.
- Stephen Jay Gould and Niles Eldredge: They proposed the [[https://en.wikipedia.org/wiki/Punctuated_equilibrium][theory of punctuated equilibria]], suggesting that evolutionary change happens in relatively quick, dramatic episodes rather than solely through gradual transformation.
#+end_index

*** No Privileged Nested Scales of Complexity

New Scales emerge from the interplay between Processes across several Nested Scales of Complexity. Applied to our universe as a whole there's no reason for an end to Nested Scales of Complexity -- what means there can be vastly more wonderous things than the human mind -- either already existing, or yet to emerge. Watch out for new catalysators!

**** The (embodied) Mind

Most people will have a hard time with this: "The mind" is often falsely granted a privileged status across many or even all aspects, often a stance of "oooh, you can't simplify it like that, it's sooo much more, and ... and ... what about love?!" -- /yes it is fascinating/, but we have to be consequent and focus on the aspects by filtering out the irrelevant. On this level of inquiry, "the mind" is to be regarded as one of several catalysators (in good company with "eukaryotes", "photosynthesis" and "sexual reproduction") that induces a transition to a novel substrate like many that came before and will come after.

**** The Physical

The idea that only the "physical realm" must be the "real thing" and somehow the "fundament" of everything is another source of confusion. The "physical" is how Nested Scales of Complexity "below" appear to certain observing complex systems (to us humans, lizard people, etc.), because we have evolved from that. "Physical existence" is observer-dependent appearance (expeiencing) according to the perspective of certain Processes (but remember that being an "observer" is not limited to "minds", but a spectrum that includes all Processes).

**** Concrete, Abstract and Virtual

Even though there is actually no such inherent dichotomy, we regard stuff as "concrete" and "abstract" for several reasons; one of them is due to we /realize/ that we have no "physical-grade" grasping of complex systems that arise "above" or arising from our immediate Scale -- those Scales that didn't play an immediate role during our evolution. Basically, we're lacking built-in qualia for experiencing successively arising Scales -- that's what we come to consider "abstract".

Even though we actually have natural means of instantation for what we consider virtual (e.g. a character in a video game, and many of us can visualize a triangle before our "inner eye"), we regard these instantiations somehow as "not real" or "not really existing", namely when the instantiation happens from the Scale of our immediate experience onwards -- e.g. our minds. Instead, we insist that only instantiation "below" is "real" (concreta). I guess this also happens because of how we humans communicate, with this crazy low bandwidth bottleneck.

For hypothetical General AI and artificial life, that might turn out very different. Both their (co-evolved) environment plus our native "physical" world might appear naturally graspable ("physical-grade") to them. But they also will evolve, and give rise to further Nested Scales of Complexity. What will set AI or ALife vastly apart, won't be merely about "processing speed", but will be the resulting incommensurable /communication bandwith/, which will enable mobility (immediate transfer, exchange) of qualia, concepts and whole live entities.

*** Questions and Answers

**** Is it sensible to erect a border between 'not-living' and 'living'?
Well, /it depends/. It depends on what we set out to reason about -- but universal borders, declared 'valid' across all inquiry are misleading and /very bad/; temporary and purpose-specific borders are indeed /helpful/. But there is no inherent border between living systems and non-living systems.

When we apply reductionism in order to focus on certain aspects, /choosing the appropriate dimension(s)/ and being consequent about it is crucial when collapsing a dynamically evolving, multi-dimensional, mycelium-like structure with fractal properties (well, that's just my imagination, but you get the point) into lower dimensions, so that the relations remain meaningful and don't suggest a skewed image that leads to screwed conclusions.

