blog/metaphysics.protoverse.project.html
<div id="outline-container-orgc91f0f4" class="outline-5">
<h5 id="orgc91f0f4"><a href="#orgc91f0f4">Examples</a></h5>
<div class="outline-text-5" id="text-orgc91f0f4">
<p>
Retrospective: a few examples of remarkable Catalytic Transitions to consider. Catalytic Transitions are characterized by emergent phenomena that introduce novelty.<br>
</p>

<ul class="org-ul">
<li>Gravity (perhaps from an evolutionary &ldquo;selective pressure&rdquo; (speed limit?) favoring the trait of locality?)<br></li>
<li>Emergence of space<br></li>
<li>Appearance of time<br></li>
<li>Supernovae distribute <a href="https://en.wikipedia.org/wiki/CHNOPS">heavier elements (CHNOPS)</a>, enabling accumulation in planets and assemblage of complex molecules<br></li>
<li>The rise of replicators (explosive acceleration of search space exploration via parallel processing)<br></li>
<li>Self-replicators (increased redundancy and resilience, arms race)<br></li>
<li><a href="https://en.wikipedia.org/wiki/Eukaryote#Origin_of_eukaryotes">Eukaryogenesis</a> (allows more complex cellular structures)<br></li>
<li>Photosynthesis (increased efficiency of energy absorption from visible light, but increased oxygen levels)<br></li>
<li><a href="https://en.wikipedia.org/wiki/Evolution_of_sexual_reproduction#Advantages_of_sex_and_sexual_reproduction">Sexual reproduction</a> (it&rsquo;s &#x2026; complicated)<br></li>
<li>Multicellular lifeforms (increases specialization and cooperation)<br></li>
<li>Photoreceptors and eyes (better interaction and survival strategies)<br></li>
<li>Nervous system and brains (advanced coordination, learning and adaption)<br></li>
<li>Evolution of consciousness (the great confusor)<br></li>
<li>Computers<br></li>
<li>The internet<br></li>
<li>Artificial intelligence systems (new playground for anthropocentric fantasies)<br></li>
<li>&#x2026; ?<br></li>
</ul>
</div>
</div>
<div id="outline-container-orgc9a434e" class="outline-5">
<h5 id="orgc9a434e"><a href="#orgc9a434e">See also:</a></h5>
<div class="outline-text-5" id="text-orgc9a434e">
<div class="index" id="org2b7a520">
<ul class="org-ul">
<li>John Maynard Smith and Eörs Szathmáry: They authored &ldquo;<a href="https://en.wikipedia.org/wiki/The_Major_Transitions_in_Evolution">The Major Transitions in Evolution</a>&rdquo;, which focuses on phase transitions in the evolution of life on Earth. They outline several significant transitions such as the origin of chromosomes, eukaryotes, sex, multicellularity, and the development of societies in certain animals.<br></li>
<li>Stephen Jay Gould and Niles Eldredge: They proposed the <a href="https://en.wikipedia.org/wiki/Punctuated_equilibrium">theory of punctuated equilibria</a>, suggesting that evolutionary change happens in relatively quick, dramatic episodes rather than solely through gradual transformation.<br></li>
</ul>

</div>
</div>
</div>
</div>
<div id="outline-container-org6c89cbc" class="outline-4">
<h4 id="org6c89cbc"><a href="#org6c89cbc">No Privileged Nested Scales of Complexity</a></h4>
<div class="outline-text-4" id="text-org6c89cbc">
<p>
New Scales emerge from the interplay between Processes across several Nested Scales of Complexity. Applied to our universe as a whole there&rsquo;s no reason for an end to Nested Scales of Complexity &#x2013; what means there can be vastly more wonderous things than the human mind &#x2013; either already existing, or yet to emerge. Watch out for new catalysators!<br>
</p>
</div>
<div id="outline-container-org83ac332" class="outline-5">
<h5 id="org83ac332"><a href="#org83ac332">The (embodied) Mind</a></h5>
<div class="outline-text-5" id="text-org83ac332">
<p>
Most people will have a hard time with this: &ldquo;The mind&rdquo; is often falsely granted a privileged status across many or even all aspects, often a stance of &ldquo;oooh, you can&rsquo;t simplify it like that, it&rsquo;s sooo much more, and &#x2026; and &#x2026; what about love?!&rdquo; &#x2013; <i>yes it is fascinating</i>, but we have to be consequent and focus on the aspects by filtering out the irrelevant. On this level of inquiry, &ldquo;the mind&rdquo; is to be regarded as one of several catalysators (in good company with &ldquo;eukaryotes&rdquo;, &ldquo;photosynthesis&rdquo; and &ldquo;sexual reproduction&rdquo;) that induces a transition to a novel substrate like many that came before and will come after.<br>
</p>
</div>
</div>
<div id="outline-container-orgeb351f8" class="outline-5">
<h5 id="orgeb351f8"><a href="#orgeb351f8">The Physical</a></h5>
<div class="outline-text-5" id="text-orgeb351f8">
<p>
The idea that only the &ldquo;physical realm&rdquo; must be the &ldquo;real thing&rdquo; and somehow the &ldquo;fundament&rdquo; of everything is another source of confusion. The &ldquo;physical&rdquo; is how Nested Scales of Complexity &ldquo;below&rdquo; appear to certain observing complex systems (to us humans, lizard people, etc.), because we have evolved from that. &ldquo;Physical existence&rdquo; is observer-dependent appearance (expeiencing) according to the perspective of certain Processes (but remember that being an &ldquo;observer&rdquo; is not limited to &ldquo;minds&rdquo;, but a spectrum that includes all Processes).<br>
</p>
</div>
</div>
<div id="outline-container-org371030a" class="outline-5">
<h5 id="org371030a"><a href="#org371030a">Concrete, Abstract and Virtual</a></h5>
<div class="outline-text-5" id="text-org371030a">
<p>
Even though there is actually no such inherent dichotomy, we regard stuff as &ldquo;concrete&rdquo; and &ldquo;abstract&rdquo; for several reasons; one of them is due to we <i>realize</i> that we have no &ldquo;physical-grade&rdquo; grasping of complex systems that arise &ldquo;above&rdquo; or arising from our immediate Scale &#x2013; those Scales that didn&rsquo;t play an immediate role during our evolution. Basically, we&rsquo;re lacking built-in qualia for experiencing successively arising Scales &#x2013; that&rsquo;s what we come to consider &ldquo;abstract&rdquo;.<br>
</p>

<p>
Even though we actually have natural means of instantation for what we consider virtual (e.g. a character in a video game, and many of us can visualize a triangle before our &ldquo;inner eye&rdquo;), we regard these instantiations somehow as &ldquo;not real&rdquo; or &ldquo;not really existing&rdquo;, namely when the instantiation happens from the Scale of our immediate experience onwards &#x2013; e.g. our minds. Instead, we insist that only instantiation &ldquo;below&rdquo; is &ldquo;real&rdquo; (concreta). I guess this also happens because of how we humans communicate, with this crazy low bandwidth bottleneck.<br>
</p>

<p>
For hypothetical General AI and artificial life, that might turn out very different. Both their (co-evolved) environment plus our native &ldquo;physical&rdquo; world might appear naturally graspable (&ldquo;physical-grade&rdquo;) to them. But they also will evolve, and give rise to further Nested Scales of Complexity. What will set AI or ALife vastly apart, won&rsquo;t be merely about &ldquo;processing speed&rdquo;, but will be the resulting incommensurable <i>communication bandwith</i>, which will enable mobility (immediate transfer, exchange) of qualia, concepts and whole live entities.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org3e12c90" class="outline-4">
<h4 id="org3e12c90"><a href="#org3e12c90">Questions and Answers</a></h4>
<div class="outline-text-4" id="text-org3e12c90">
</div>
<div id="outline-container-org81fdc41" class="outline-5">
<h5 id="org81fdc41"><a href="#org81fdc41">Is it sensible to erect a border between &rsquo;not-living&rsquo; and &rsquo;living&rsquo;?</a></h5>
<div class="outline-text-5" id="text-org81fdc41">
<p>
Well, <i>it depends</i>. It depends on what we set out to reason about &#x2013; but universal borders, declared &rsquo;valid&rsquo; across all inquiry are misleading and <i>very bad</i>; temporary and purpose-specific borders are indeed <i>helpful</i>. But there is no inherent border between living systems and non-living systems.<br>
</p>

<p>
When we apply reductionism in order to focus on certain aspects, <i>choosing the appropriate dimension(s)</i> and being consequent about it is crucial when collapsing a dynamically evolving, multi-dimensional, mycelium-like structure with fractal properties (well, that&rsquo;s just my imagination, but you get the point) into lower dimensions, so that the relations remain meaningful and don&rsquo;t suggest a skewed image that leads to screwed conclusions.<br>
</p>
</div>
</div>
