blog/metaphysics.protoverse.project.org
**** Can Nested Scales of Complexity co-evolve, merge, dissolve or collapse?
Co-Evolution through Interscale-Compatibility is an integral requirement for open-ended evolution. The "Nested Scales of Complexity" view helps to understand how scaling into open-endedness becomes possible; what actually co-evolves are quite simply Processes with Processes. Processes can "merge" (become higher-order Processes), and higher-order Processes can /transform/ into lower-order Processes ("dissolve" or "collapse"), but they cannot simply "disappear" -- quite like "Energy" cannot "disappear" in the conceptual framework that we call physics.

**** Do Nested Scales of Complexity Become Increasingly Complex?
There's the problem how to define and measure complexity. 'Complexity' is an unwieldy, hand-wavy term and multi-dimensional on top of that. I think that complexity cannot be defined or used in a general fashion, but is framework-dependent, so that the extend and significance of its dimensions have to be adjusted from case to case.

Deeper Nested Scales of Complexity doesn't imply that such a Scale must itself be more complex: A mountainbike is certainly much less complex than a goldfish. But that's also a very isolated object-centric view that ignores the relational (historical and causal) contexts, which are maintained by the model of interrelated /Processes/ which constitute the two configurations "mountainbike" and "goldfish".

But that, in turn, doesn't mean that mountainbikes and goldfish are determined by their history -- not even if both were destroyed or dead, respectively (they're not destroyed or dead of course: The mountain bike survived its first parachute flight. And the goldfish has met a sexually di-morphic freshwater-shrimp, and they got married just recently).

Complexity is neither a goal, nor a means in itself. How entropy is currently understood, complexity isn't globally increasing, but entropy seems to. The prevalent opinion says that our universe will result in "heat death" (I doubt that), the most boring equilibrium ever imagined -- which is considered the opposite of complexity. Likewise, a state of lowest possible entropy is considered equally non-complex.

Entropy might turn out way more nuanced than we think it is, and depends on the framework (physics vs. information theory vs. ...). But there's the fact that /replicators/ are involved in certain parts -- replicators replicate by /doubling/, by which entropy decreases exponentially. But also, there can be singular events, like a meteorite, that could wipe out the population of a whole planet (for a while at least).

**** 'Nested Scales of Complexity' doesn't mean 'higher-order Processes of the same nth-order'
The Processes tightly associated with a certain Nested Scale of Emergence are a comglomerate (nexus) of many inter-related Processes that form one or more complex systems. These interacting Processes ultimately originated from more primitive Processes, but they likely have unique histories, relations and are ultimately composed from different numbers of higher-order and primitive Processes.

Apart from that: each Scale can be described as a higher-order Process -- and vice versa: each higher-order Process can be described as a Nested Scale of Emergence. It's just that applying these view emphasize different aspects.

*** Resemblances Within Other Theories and Areas

I've been curiously looking around which theories and frameworks employ concepts similar to the Nested Scales of Complexity. The general idea of nested systems are used throughout various areas of research, here's what I found:

#+begin_index
- There's [[https://theoperatortheory.info/][O-theory]] (PHD thesis and book: "[[https://repository.ubn.ru.nl/bitstream/handle/2066/82605/82605;jsessionid=9F23B2F65AC77A966340A8AC5D569486?sequence=1][The Operator Hierarchy]]") from Gerard Jagers op Akkerhuis, which seems to come close. I began to read the thesis, and try to gauge its expressive power.

- My idea of "Nested Scales of Complexity" and their "Catalytic Transitions" seem quite similar to the "[[https://en.wikipedia.org/wiki/Metasystem_transition][metasystem transitions]]" framework by [[https://en.wikipedia.org/wiki/Valentin_Turchin][Valentin Turchin]]. This theory looks quite teleological, though -- and he was a cybernetician, hence he uses a different terminology.

- [[https://en.wikipedia.org/wiki/Multiscale_modeling][Multiscale Modeling]]: That's basically what's inherent to the Protoverse -- modeling non-linear dynamic systems that interact at various scales.
#+end_index

** Relation between Entropy and Evolution

While entropy deserves a top level section on its own, I found no proper place to introduce it earlier, but we need to consider entropy in the context of Universal Darwinism in order to understand why change happens -- or rather /why anything happens/ at all.

Decrease in Entropy through Increased Entanglement (and Information)

The evolutionary cycle, once established, decreases entropy by increasing relations (entanglement), therefore it creates and increases knowledge about state, and also increases and propagates the resulting information throughout the system.

In principle, there are no living systems required for its effect, but living systems are increasingly effective in creating negentropy.

Once living systems appear, they decrease entropy even further while they are /becoming their own environment/, as a means of the evolutionary process creating and establishing this scale of complexity (from which further scales emerge, where the evolutionary process continues. The process' "implementation" is going to be different then, depending on the peculiarities of these newly emerging scales of complexity).

