blog/metaphysics.protoverse.project.html
<div id="outline-container-org0959809" class="outline-5">
<h5 id="org0959809"><a href="#org0959809">Can Nested Scales of Complexity co-evolve, merge, dissolve or collapse?</a></h5>
<div class="outline-text-5" id="text-org0959809">
<p>
Co-Evolution through Interscale-Compatibility is an integral requirement for open-ended evolution. The &ldquo;Nested Scales of Complexity&rdquo; view helps to understand how scaling into open-endedness becomes possible; what actually co-evolves are quite simply Processes with Processes. Processes can &ldquo;merge&rdquo; (become higher-order Processes), and higher-order Processes can <i>transform</i> into lower-order Processes (&ldquo;dissolve&rdquo; or &ldquo;collapse&rdquo;), but they cannot simply &ldquo;disappear&rdquo; &#x2013; quite like &ldquo;Energy&rdquo; cannot &ldquo;disappear&rdquo; in the conceptual framework that we call physics.<br>
</p>
</div>
</div>
<div id="outline-container-org7f5fdc8" class="outline-5">
<h5 id="org7f5fdc8"><a href="#org7f5fdc8">Do Nested Scales of Complexity Become Increasingly Complex?</a></h5>
<div class="outline-text-5" id="text-org7f5fdc8">
<p>
There&rsquo;s the problem how to define and measure complexity. &rsquo;Complexity&rsquo; is an unwieldy, hand-wavy term and multi-dimensional on top of that. I think that complexity cannot be defined or used in a general fashion, but is framework-dependent, so that the extend and significance of its dimensions have to be adjusted from case to case.<br>
</p>

<p>
Deeper Nested Scales of Complexity doesn&rsquo;t imply that such a Scale must itself be more complex: A mountainbike is certainly much less complex than a goldfish. But that&rsquo;s also a very isolated object-centric view that ignores the relational (historical and causal) contexts, which are maintained by the model of interrelated <i>Processes</i> which constitute the two configurations &ldquo;mountainbike&rdquo; and &ldquo;goldfish&rdquo;.<br>
</p>

<p>
But that, in turn, doesn&rsquo;t mean that mountainbikes and goldfish are determined by their history &#x2013; not even if both were destroyed or dead, respectively (they&rsquo;re not destroyed or dead of course: The mountain bike survived its first parachute flight. And the goldfish has met a sexually di-morphic freshwater-shrimp, and they got married just recently).<br>
</p>

<p>
Complexity is neither a goal, nor a means in itself. How entropy is currently understood, complexity isn&rsquo;t globally increasing, but entropy seems to. The prevalent opinion says that our universe will result in &ldquo;heat death&rdquo; (I doubt that), the most boring equilibrium ever imagined &#x2013; which is considered the opposite of complexity. Likewise, a state of lowest possible entropy is considered equally non-complex.<br>
</p>

<p>
Entropy might turn out way more nuanced than we think it is, and depends on the framework (physics vs. information theory vs. &#x2026;). But there&rsquo;s the fact that <i>replicators</i> are involved in certain parts &#x2013; replicators replicate by <i>doubling</i>, by which entropy decreases exponentially. But also, there can be singular events, like a meteorite, that could wipe out the population of a whole planet (for a while at least).<br>
</p>
</div>
</div>
<div id="outline-container-org93c166c" class="outline-5">
<h5 id="org93c166c"><a href="#org93c166c">&rsquo;Nested Scales of Complexity&rsquo; doesn&rsquo;t mean &rsquo;higher-order Processes of the same nth-order&rsquo;</a></h5>
<div class="outline-text-5" id="text-org93c166c">
<p>
The Processes tightly associated with a certain Nested Scale of Emergence are a comglomerate (nexus) of many inter-related Processes that form one or more complex systems. These interacting Processes ultimately originated from more primitive Processes, but they likely have unique histories, relations and are ultimately composed from different numbers of higher-order and primitive Processes.<br>
</p>

<p>
Apart from that: each Scale can be described as a higher-order Process &#x2013; and vice versa: each higher-order Process can be described as a Nested Scale of Emergence. It&rsquo;s just that applying these view emphasize different aspects.<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org5688e56" class="outline-4">
<h4 id="org5688e56"><a href="#org5688e56">Resemblances Within Other Theories and Areas</a></h4>
<div class="outline-text-4" id="text-org5688e56">
<p>
I&rsquo;ve been curiously looking around which theories and frameworks employ concepts similar to the Nested Scales of Complexity. The general idea of nested systems are used throughout various areas of research, here&rsquo;s what I found:<br>
</p>

<div class="index" id="orge25fc66">
<ul class="org-ul">
<li>There&rsquo;s <a href="https://theoperatortheory.info/">O-theory</a> (PHD thesis and book: &ldquo;<a href="https://repository.ubn.ru.nl/bitstream/handle/2066/82605/82605;jsessionid=9F23B2F65AC77A966340A8AC5D569486?sequence=1">The Operator Hierarchy</a>&rdquo;) from Gerard Jagers op Akkerhuis, which seems to come close. I began to read the thesis, and try to gauge its expressive power.<br></li>

<li>My idea of &ldquo;Nested Scales of Complexity&rdquo; and their &ldquo;Catalytic Transitions&rdquo; seem quite similar to the &ldquo;<a href="https://en.wikipedia.org/wiki/Metasystem_transition">metasystem transitions</a>&rdquo; framework by <a href="https://en.wikipedia.org/wiki/Valentin_Turchin">Valentin Turchin</a>. This theory looks quite teleological, though &#x2013; and he was a cybernetician, hence he uses a different terminology.<br></li>

<li><a href="https://en.wikipedia.org/wiki/Multiscale_modeling">Multiscale Modeling</a>: That&rsquo;s basically what&rsquo;s inherent to the Protoverse &#x2013; modeling non-linear dynamic systems that interact at various scales.<br></li>
</ul>

</div>
</div>
</div>
</div>
<div id="outline-container-org7c5c97e" class="outline-3">
<h3 id="org7c5c97e"><a href="#org7c5c97e">Relation between Entropy and Evolution</a></h3>
<div class="outline-text-3" id="text-org7c5c97e">
<p>
While entropy deserves a top level section on its own, I found no proper place to introduce it earlier, but we need to consider entropy in the context of Universal Darwinism in order to understand why change happens &#x2013; or rather <i>why anything happens</i> at all.<br>
</p>

<p>
Decrease in Entropy through Increased Entanglement (and Information)<br>
</p>

<p>
The evolutionary cycle, once established, decreases entropy by increasing relations (entanglement), therefore it creates and increases knowledge about state, and also increases and propagates the resulting information throughout the system.<br>
</p>

<p>
In principle, there are no living systems required for its effect, but living systems are increasingly effective in creating negentropy.<br>
</p>

<p>
Once living systems appear, they decrease entropy even further while they are <i>becoming their own environment</i>, as a means of the evolutionary process creating and establishing this scale of complexity (from which further scales emerge, where the evolutionary process continues. The process&rsquo; &ldquo;implementation&rdquo; is going to be different then, depending on the peculiarities of these newly emerging scales of complexity).<br>
</p>
</div>
</div>
