blog/metaphysics.protoverse.project.org
** Darwin-style Evolution in an Artificial Universe

Evolutionary computation often employs extrinsic, goal-directed forms of evolutionary processes -- because genetic algorithms are used to solve practical problems, and even if not, they operate within an isolated setting, where the environment often serves as a modest backdrop.

This project's approach is a bit different from that: The aim here is to build a non-deterministic, multi-scale computational substrates where intrinsic, open-ended evolutionary processes are the consequential outcome of systemic interactions.

From a process-relational perspective, Processes resist "extinction" and continue evolving because they aren't susceptible to death. This could enable /direct knowledge inheritance/, which means that Processes can pass on information without a selection process acting on replicated variations. It might accelerate evolution, when favorable developments are preserved and propagated directly, without the need to be "rediscovered" by each new generation through replication and selection.

Compared to replication-based evolution, there are potential drawbacks to consider:

- Replication leverages parallel processing, by which a large search space is explored quite fast, and the resulting diversity

Evolution not based on replication doesn't rule out the emergence of evolution which is based on replication, as the latter could arise as a more effective strategy on certain scales of emerging complexity..

*** Necessary Conditions for Open-Ended Evolution

Open-endedness pertains to the continual generation of novelty and complexity without an end-goal or a limit on the diversity of forms that evolution can explore, acknowledging practical constraints.

I believe that evolutionary dynamics arise intrinsically in certain kinds of complex systems, because the constutients -- variety, repetition, selection, retention -- are already present in complex systems.

**** Background independence
There is no distinction between "entities" and "environment", because the entities are Processes and they are /becoming/ their "environment". What we conventionally consider to be "entities" are relations of processes, and the "environment" is not a separate canvas, but is constituted by the network of interactions among these Processes, and the relations created thereof. A half-assed version of that is commonly understood as "co-evolution".

**** Emergence of higher-order Processes
It seems that one requirement for open-ended evolution and true novelty is to enable catalytic transitions which lead to the emergence of Nested Scales of Complexity. In natural evolution, this emergence of higher-order scales (e.g. molecules to cells to organisms) is a hallmark of the open-endedness.

**** Inter-Process connectivity
Novel phenomena most likely emerge at the edge of chaos. Higher-order and lower-order Processes must be compatible to interact meaningfully; but compatibility is only guaranteed between primitive Processes; higher-order Processes are expected to evolve novel ways of interaction. (See also "interscale connectivity".)

**** Co-evolving epistemological scope* and interfaces
.....

**** Meta-Evolution
The "rules" themselves can change, creating another, or more levels of evolution beyond the initial one. Here, the Processes aren't just aligned to initial rules but also are effective in creating and changing rules, independent of survival pressures (analogy: wave diffraction)

**** Oscillators
Disruptions at regular intervals may help to migitate premature convergence (settling into a fixed approach too early). Cycles similar to day/night, tides or seasonal changes are examples of such periodic perturbations.

**** Probablistic / non-deterministic system
.....

**** Edge of Chaos
.....

**** Black Swan Events
.....

*** Drivers of Computational Evolution

In the Protoverse, the aim of evolution could be seen as a drive for novelty, exploration, understanding, creativity and sophistication rather than survival. In a post-scarcity environment (it might be the case), the challenge isn’t to secure resources, but to make sense of information.

#+begin_index
- The process-relational model I described so far introduces uncertainty naturally, because anything we would recognize as discrete objects (physical things, individuals, identities, integers, etc) are approximations to begin with.

-  Realizing and acknowledging novel situations or patterns created by the evolution of interacting processes is quite a challenge. It's central to a Process' ability of any order to adapt, learn, and evolve (Processes are recursive).

- Each Process has its subjective experience. As processes interact, evolve and become part of more complex Processes, the nature of subjective experience will become more nuanced. Adapting to and striving for consensus (e.g. a shared reality between processes) will pose a challenge.

- In an universe where Experience exists on a spectrum, emergent phenomena will lead to new forms/domains of experience. This phenomenological richness can drive Processes to continuously evolve, in order to further explore and understand the diversity of Experiences.
#+end_index

* Traditional Metaphysical Questions

Philosophy and Metaphysics in particular are stuck in the past and dwell way too much on anthropocentrism, hence many "philosophical questions" are either a matter of the shortcomings of ordinary language, or are loaded questions to begin with. Nevertheless, I would like to address some classical views in order to provide a common ground:

Many dichotomies and categorizations commonly tied to substance-materialist worldview don't apply for a process-relational framework. Here are some not-so-obvious departures from classical views:

| Classical categories | Protoverse                                                   |
|----------------------+--------------------------------------------------------------|
| Realism/Idealism     | The Mind is not privileged, multiplicity of nested Scales    |
| Subject/Object       | Only subjects (Processes), resp. superjects                  |
| Monist/Dualist       | Monist pluralism, embracing diversity without ontological separation |
| Mind/Matter          | Nested inter-related evolving systems, no privileges or fundamental divide |
| Abstract/Concrete    | Context-dependent experiencing on multiple scales                 |

