blog/metaphysics.protoverse.project.html
<div id="outline-container-org6d68416" class="outline-3">
<h3 id="org6d68416"><a href="#org6d68416">Darwin-style Evolution in an Artificial Universe</a></h3>
<div class="outline-text-3" id="text-org6d68416">
<p>
Evolutionary computation often employs extrinsic, goal-directed forms of evolutionary processes &#x2013; because genetic algorithms are used to solve practical problems, and even if not, they operate within an isolated setting, where the environment often serves as a modest backdrop.<br>
</p>

<p>
This project&rsquo;s approach is a bit different from that: The aim here is to build a non-deterministic, multi-scale computational substrates where intrinsic, open-ended evolutionary processes are the consequential outcome of systemic interactions.<br>
</p>

<p>
From a process-relational perspective, Processes resist &ldquo;extinction&rdquo; and continue evolving because they aren&rsquo;t susceptible to death. This could enable <i>direct knowledge inheritance</i>, which means that Processes can pass on information without a selection process acting on replicated variations. It might accelerate evolution, when favorable developments are preserved and propagated directly, without the need to be &ldquo;rediscovered&rdquo; by each new generation through replication and selection.<br>
</p>

<p>
Compared to replication-based evolution, there are potential drawbacks to consider:<br>
</p>

<ul class="org-ul">
<li>Replication leverages parallel processing, by which a large search space is explored quite fast, and the resulting diversity<br></li>
</ul>

<p>
Evolution not based on replication doesn&rsquo;t rule out the emergence of evolution which is based on replication, as the latter could arise as a more effective strategy on certain scales of emerging complexity..<br>
</p>
</div>
<div id="outline-container-org92598c9" class="outline-4">
<h4 id="org92598c9"><a href="#org92598c9">Necessary Conditions for Open-Ended Evolution</a></h4>
<div class="outline-text-4" id="text-org92598c9">
<p>
Open-endedness pertains to the continual generation of novelty and complexity without an end-goal or a limit on the diversity of forms that evolution can explore, acknowledging practical constraints.<br>
</p>

<p>
I believe that evolutionary dynamics arise intrinsically in certain kinds of complex systems, because the constutients &#x2013; variety, repetition, selection, retention &#x2013; are already present in complex systems.<br>
</p>
</div>
<div id="outline-container-orgc66b19e" class="outline-5">
<h5 id="orgc66b19e"><a href="#orgc66b19e">Background independence</a></h5>
<div class="outline-text-5" id="text-orgc66b19e">
<p>
There is no distinction between &ldquo;entities&rdquo; and &ldquo;environment&rdquo;, because the entities are Processes and they are <i>becoming</i> their &ldquo;environment&rdquo;. What we conventionally consider to be &ldquo;entities&rdquo; are relations of processes, and the &ldquo;environment&rdquo; is not a separate canvas, but is constituted by the network of interactions among these Processes, and the relations created thereof. A half-assed version of that is commonly understood as &ldquo;co-evolution&rdquo;.<br>
</p>
</div>
</div>
<div id="outline-container-orga251adb" class="outline-5">
<h5 id="orga251adb"><a href="#orga251adb">Emergence of higher-order Processes</a></h5>
<div class="outline-text-5" id="text-orga251adb">
<p>
It seems that one requirement for open-ended evolution and true novelty is to enable catalytic transitions which lead to the emergence of Nested Scales of Complexity. In natural evolution, this emergence of higher-order scales (e.g. molecules to cells to organisms) is a hallmark of the open-endedness.<br>
</p>
</div>
</div>
<div id="outline-container-orgad7935c" class="outline-5">
<h5 id="orgad7935c"><a href="#orgad7935c">Inter-Process connectivity</a></h5>
<div class="outline-text-5" id="text-orgad7935c">
<p>
Novel phenomena most likely emerge at the edge of chaos. Higher-order and lower-order Processes must be compatible to interact meaningfully; but compatibility is only guaranteed between primitive Processes; higher-order Processes are expected to evolve novel ways of interaction. (See also &ldquo;interscale connectivity&rdquo;.)<br>
</p>
</div>
</div>
<div id="outline-container-org8fce963" class="outline-5">
<h5 id="org8fce963"><a href="#org8fce963">Co-evolving epistemological scope* and interfaces</a></h5>
<div class="outline-text-5" id="text-org8fce963">
<p>
&#x2026;..<br>
</p>
</div>
</div>
<div id="outline-container-orge26343a" class="outline-5">
<h5 id="orge26343a"><a href="#orge26343a">Meta-Evolution</a></h5>
<div class="outline-text-5" id="text-orge26343a">
<p>
The &ldquo;rules&rdquo; themselves can change, creating another, or more levels of evolution beyond the initial one. Here, the Processes aren&rsquo;t just aligned to initial rules but also are effective in creating and changing rules, independent of survival pressures (analogy: wave diffraction)<br>
</p>
</div>
</div>
<div id="outline-container-org9857bd8" class="outline-5">
<h5 id="org9857bd8"><a href="#org9857bd8">Oscillators</a></h5>
<div class="outline-text-5" id="text-org9857bd8">
<p>
Disruptions at regular intervals may help to migitate premature convergence (settling into a fixed approach too early). Cycles similar to day/night, tides or seasonal changes are examples of such periodic perturbations.<br>
</p>
</div>
</div>
<div id="outline-container-org425750d" class="outline-5">
<h5 id="org425750d"><a href="#org425750d">Probablistic / non-deterministic system</a></h5>
<div class="outline-text-5" id="text-org425750d">
<p>
&#x2026;..<br>
</p>
</div>
</div>
<div id="outline-container-org2fce801" class="outline-5">
<h5 id="org2fce801"><a href="#org2fce801">Edge of Chaos</a></h5>
<div class="outline-text-5" id="text-org2fce801">
<p>
&#x2026;..<br>
</p>
</div>
</div>
<div id="outline-container-org07a84de" class="outline-5">
<h5 id="org07a84de"><a href="#org07a84de">Black Swan Events</a></h5>
<div class="outline-text-5" id="text-org07a84de">
<p>
&#x2026;..<br>
</p>
</div>
</div>
</div>
<div id="outline-container-org0946d62" class="outline-4">
<h4 id="org0946d62"><a href="#org0946d62">Drivers of Computational Evolution</a></h4>
<div class="outline-text-4" id="text-org0946d62">
<p>
In the Protoverse, the aim of evolution could be seen as a drive for novelty, exploration, understanding, creativity and sophistication rather than survival. In a post-scarcity environment (it might be the case), the challenge isn’t to secure resources, but to make sense of information.<br>
</p>

<div class="index" id="org6095a3a">
<ul class="org-ul">
<li>The process-relational model I described so far introduces uncertainty naturally, because anything we would recognize as discrete objects (physical things, individuals, identities, integers, etc) are approximations to begin with.<br></li>

<li>Realizing and acknowledging novel situations or patterns created by the evolution of interacting processes is quite a challenge. It&rsquo;s central to a Process&rsquo; ability of any order to adapt, learn, and evolve (Processes are recursive).<br></li>

<li>Each Process has its subjective experience. As processes interact, evolve and become part of more complex Processes, the nature of subjective experience will become more nuanced. Adapting to and striving for consensus (e.g. a shared reality between processes) will pose a challenge.<br></li>

<li>In an universe where Experience exists on a spectrum, emergent phenomena will lead to new forms/domains of experience. This phenomenological richness can drive Processes to continuously evolve, in order to further explore and understand the diversity of Experiences.<br></li>
</ul>

</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org3601c33" class="outline-2">
<h2 id="org3601c33"><a href="#org3601c33">Traditional Metaphysical Questions</a></h2>
<div class="outline-text-2" id="text-org3601c33">
<p>
Philosophy and Metaphysics in particular are stuck in the past and dwell way too much on anthropocentrism, hence many &ldquo;philosophical questions&rdquo; are either a matter of the shortcomings of ordinary language, or are loaded questions to begin with. Nevertheless, I would like to address some classical views in order to provide a common ground:<br>
</p>

<p>
Many dichotomies and categorizations commonly tied to substance-materialist worldview don&rsquo;t apply for a process-relational framework. Here are some not-so-obvious departures from classical views:<br>
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Classical categories</th>
<th scope="col" class="org-left">Protoverse</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Realism/Idealism</td>
<td class="org-left">The Mind is not privileged, multiplicity of nested Scales</td>
</tr>

<tr>
<td class="org-left">Subject/Object</td>
<td class="org-left">Only subjects (Processes), resp. superjects</td>
</tr>

<tr>
<td class="org-left">Monist/Dualist</td>
<td class="org-left">Monist pluralism, embracing diversity without ontological separation</td>
</tr>

<tr>
<td class="org-left">Mind/Matter</td>
<td class="org-left">Nested inter-related evolving systems, no privileges or fundamental divide</td>
</tr>

<tr>
<td class="org-left">Abstract/Concrete</td>
<td class="org-left">Context-dependent experiencing on multiple scales</td>
</tr>
</tbody>
</table>
</div>
