blog/metaphysics.protoverse.project.org
** Existing vs. Not Existing

Do numbers "exist"? Well, which ones? Does a particular number exist? Or do all numbers exist? What about other abstract objects -- are there differences? Well, the question would be possible to answer if we would have an absoulutely clear definition of what "exist" means. 

** Abstract vs. Concrete

#+begin_index
- *Abstracta:* What's broadly considered as 'abstract' could be viewed as 'algorithmic' -- relational structures between primitive (and within higher-order) Processes that exhibit a declarative aspect.

- *Concreta:* Processes are like acts of 'running algorithms' that create systems of further interrelated Processes -- that in turn could be considered as 'concrete'.
#+end_index

But I rather forced both descriptions. The point is that both "abstract" and "concrete" aspects are inseparable and occur in such a tangled interplay at evolving, nested and inter-related scales. There are not really definite boundaries. Overall, trying to apply this dichotomy wouldn't contribute to better understanding.

This is also quite different to Alfred North Whitehead's process ontology, who reserved a special category "eternal objects". I'm actually quite happy that we don't have to make up an awkward "special place" for "the abstract".

*** What are Numbers?

Numbers are commonly recognized as quintessential examples of abstract objects. But "numbers" is a broad term: the idea/concept of numbers, a particular number, a bunch of numbers. Let's think a bit about numbers, and what they might be.

Various animal species grasp relative quantities. Throughout our animal kingom, numerical cognition majors on relational aspects (such as 'more', 'less', 'equal', 'numerous', 'few'). Only a few species exhibit a concept of "exact" numbers: crows do, squirrels seemingly not; the concept of exact numbers may not be a universal necessity for "functioning" in the world -- at least no at all scales. So what we have until yet, is a recognition of difference within a certain dimension -- that could be the momentary or temporal (before/after) occupation of the field of vision, for instance -- the recognition of difference and a means to describe that difference.

"Exact" numbers though, do seem to require a form of counting or a underpinning counting-like process. Hence, the concept of numbers in the most general sense may be defined as "units in a sequence established by the repeated application of a certain rule", which leads to a /regular sequence/. This gives us a means of "relating relations" by giving them names according to a derivative rule.

The most straightforward algorithm to construct the sequence of the "natural" numbers is by incrementally adding 1 discrete unit at a time ~(n + 1)~ to a previously accumulated pile of units. Interestingly, it could be argued that the more "natural" way to count is by /doubling/. Doubling ~(n + n)~ is much more prevalent in nature (e.g. cell division and most biological systems) than linear incrementing by 1 ~(n + 1)~. Doubling is even /conceptionally simpler/ than incrementing by 1 -- because it requires less preconceptions (you may realize that when you shovel aside the anthropocentric bias. Fellow wanderer, do you accept the side quest?).

At this point we may contend that the "more natural" counting method by doubling is utter rubbish -- this number sequence does not provide direct access to "all" numbers, because aren't there a lot of numbers missing? There's no 3, 6, 7, 9 ...? Well no, these numbers are not missing, it's just bias -- because we are used to the linear progression of "natural" numbers. Picture it this way: neither does the usual ~(n + 1)~ number sequence give you "all" numbers -- for instance it gives you no 9¾, which would cause you to miss the train.

Ok, so numbers are also sequences built on arbritrary, regular relations. Our "natural" numbers are just as arbritary, because any number only acquires meaning in relation to the particularly defined sequence it happens to be part of by definition. Hence, seemingly inherent properties of numbers are relational to the encompassing system that implies these properties; and properties are either axioms or theorems. It makes no sense to think of properties as inherent of particular numbers (or of anything else, even physical matter).

Of course then, from the common substantial-materialist point of view, properties seem "external" of the "object" in question, which may feel wrong (actually just counter-intuitive). But that's only because a substantial-materialist point of view presupposes "standalone entities", and common sense implies that "properties" can only be "within". This is related to our deeply rooted habit of drawing borders ad-hoc and arbitrarily, and several other biases.

The sequence of natural numbers is not inherently special or "natural". It only appears so, largely due to the cognitive context of discrete objects, and because we just consider it useful for certain purposes. But we also quite often see the need to use other number systems, like the rational numbers. And we'll need to break out of several schemas in order to float freely in the continuum or "number universe" (real numbers) where we could directly "access", "construct" or "manifest" all numbers. What got it into the cage in the first place - intuition?

What if we would treat the real numbers as fundamental, instead of the natural numbers? That way leads to much more straightforward methods: for instance, it's much less involved to derive the natural numbers from the real numbers, than the usual way from natural number to the reals (which feels very much like reverse-engineering).

Treating the continuum as fundamental also seems to align much more with how perception may work - from a cognitive standpoint, humans and other animals interpret continuous sensory data (like vision or sound) and extract patterns from it, in order to construct discrete objects in their minds.

