blog/metaphysics.protoverse.project.html
<div id="outline-container-orga80c591" class="outline-3">
<h3 id="orga80c591"><a href="#orga80c591">Existing vs. Not Existing</a></h3>
<div class="outline-text-3" id="text-orga80c591">
<p>
Do numbers &ldquo;exist&rdquo;? Well, which ones? Does a particular number exist? Or do all numbers exist? What about other abstract objects &#x2013; are there differences? Well, the question would be possible to answer if we would have an absoulutely clear definition of what &ldquo;exist&rdquo; means.<br>
</p>
</div>
</div>
<div id="outline-container-org040a4ab" class="outline-3">
<h3 id="org040a4ab"><a href="#org040a4ab">Abstract vs. Concrete</a></h3>
<div class="outline-text-3" id="text-org040a4ab">
<div class="index" id="org978cc26">
<ul class="org-ul">
<li><b>Abstracta:</b> What&rsquo;s broadly considered as &rsquo;abstract&rsquo; could be viewed as &rsquo;algorithmic&rsquo; &#x2013; relational structures between primitive (and within higher-order) Processes that exhibit a declarative aspect.<br></li>

<li><b>Concreta:</b> Processes are like acts of &rsquo;running algorithms&rsquo; that create systems of further interrelated Processes &#x2013; that in turn could be considered as &rsquo;concrete&rsquo;.<br></li>
</ul>

</div>

<p>
But I rather forced both descriptions. The point is that both &ldquo;abstract&rdquo; and &ldquo;concrete&rdquo; aspects are inseparable and occur in such a tangled interplay at evolving, nested and inter-related scales. There are not really definite boundaries. Overall, trying to apply this dichotomy wouldn&rsquo;t contribute to better understanding.<br>
</p>

<p>
This is also quite different to Alfred North Whitehead&rsquo;s process ontology, who reserved a special category &ldquo;eternal objects&rdquo;. I&rsquo;m actually quite happy that we don&rsquo;t have to make up an awkward &ldquo;special place&rdquo; for &ldquo;the abstract&rdquo;.<br>
</p>
</div>
<div id="outline-container-org2b712a6" class="outline-4">
<h4 id="org2b712a6"><a href="#org2b712a6">What are Numbers?</a></h4>
<div class="outline-text-4" id="text-org2b712a6">
<p>
Numbers are commonly recognized as quintessential examples of abstract objects. But &ldquo;numbers&rdquo; is a broad term: the idea/concept of numbers, a particular number, a bunch of numbers. Let&rsquo;s think a bit about numbers, and what they might be.<br>
</p>

<p>
Various animal species grasp relative quantities. Throughout our animal kingom, numerical cognition majors on relational aspects (such as &rsquo;more&rsquo;, &rsquo;less&rsquo;, &rsquo;equal&rsquo;, &rsquo;numerous&rsquo;, &rsquo;few&rsquo;). Only a few species exhibit a concept of &ldquo;exact&rdquo; numbers: crows do, squirrels seemingly not; the concept of exact numbers may not be a universal necessity for &ldquo;functioning&rdquo; in the world &#x2013; at least no at all scales. So what we have until yet, is a recognition of difference within a certain dimension &#x2013; that could be the momentary or temporal (before/after) occupation of the field of vision, for instance &#x2013; the recognition of difference and a means to describe that difference.<br>
</p>

<p>
&ldquo;Exact&rdquo; numbers though, do seem to require a form of counting or a underpinning counting-like process. Hence, the concept of numbers in the most general sense may be defined as &ldquo;units in a sequence established by the repeated application of a certain rule&rdquo;, which leads to a <i>regular sequence</i>. This gives us a means of &ldquo;relating relations&rdquo; by giving them names according to a derivative rule.<br>
</p>

<p>
The most straightforward algorithm to construct the sequence of the &ldquo;natural&rdquo; numbers is by incrementally adding 1 discrete unit at a time <code>(n + 1)</code> to a previously accumulated pile of units. Interestingly, it could be argued that the more &ldquo;natural&rdquo; way to count is by <i>doubling</i>. Doubling <code>(n + n)</code> is much more prevalent in nature (e.g. cell division and most biological systems) than linear incrementing by 1 <code>(n + 1)</code>. Doubling is even <i>conceptionally simpler</i> than incrementing by 1 &#x2013; because it requires less preconceptions (you may realize that when you shovel aside the anthropocentric bias. Fellow wanderer, do you accept the side quest?).<br>
</p>

<p>
At this point we may contend that the &ldquo;more natural&rdquo; counting method by doubling is utter rubbish &#x2013; this number sequence does not provide direct access to &ldquo;all&rdquo; numbers, because aren&rsquo;t there a lot of numbers missing? There&rsquo;s no 3, 6, 7, 9 &#x2026;? Well no, these numbers are not missing, it&rsquo;s just bias &#x2013; because we are used to the linear progression of &ldquo;natural&rdquo; numbers. Picture it this way: neither does the usual <code>(n + 1)</code> number sequence give you &ldquo;all&rdquo; numbers &#x2013; for instance it gives you no 9¾, which would cause you to miss the train.<br>
</p>

<p>
Ok, so numbers are also sequences built on arbritrary, regular relations. Our &ldquo;natural&rdquo; numbers are just as arbritary, because any number only acquires meaning in relation to the particularly defined sequence it happens to be part of by definition. Hence, seemingly inherent properties of numbers are relational to the encompassing system that implies these properties; and properties are either axioms or theorems. It makes no sense to think of properties as inherent of particular numbers (or of anything else, even physical matter).<br>
</p>

<p>
Of course then, from the common substantial-materialist point of view, properties seem &ldquo;external&rdquo; of the &ldquo;object&rdquo; in question, which may feel wrong (actually just counter-intuitive). But that&rsquo;s only because a substantial-materialist point of view presupposes &ldquo;standalone entities&rdquo;, and common sense implies that &ldquo;properties&rdquo; can only be &ldquo;within&rdquo;. This is related to our deeply rooted habit of drawing borders ad-hoc and arbitrarily, and several other biases.<br>
</p>

<p>
The sequence of natural numbers is not inherently special or &ldquo;natural&rdquo;. It only appears so, largely due to the cognitive context of discrete objects, and because we just consider it useful for certain purposes. But we also quite often see the need to use other number systems, like the rational numbers. And we&rsquo;ll need to break out of several schemas in order to float freely in the continuum or &ldquo;number universe&rdquo; (real numbers) where we could directly &ldquo;access&rdquo;, &ldquo;construct&rdquo; or &ldquo;manifest&rdquo; all numbers. What got it into the cage in the first place - intuition?<br>
</p>

<p>
What if we would treat the real numbers as fundamental, instead of the natural numbers? That way leads to much more straightforward methods: for instance, it&rsquo;s much less involved to derive the natural numbers from the real numbers, than the usual way from natural number to the reals (which feels very much like reverse-engineering).<br>
</p>

<p>
Treating the continuum as fundamental also seems to align much more with how perception may work - from a cognitive standpoint, humans and other animals interpret continuous sensory data (like vision or sound) and extract patterns from it, in order to construct discrete objects in their minds.<br>
</p>
</div>
</div>
