blog/metaphysics.protoverse.project.org
*** The Infinite

The widely accepted invention of 'completed infinity' (masked by the euphemism 'actual infinity') literally means "the finished unfinished" and is a contradiction in itself, quite analogous to the "square circle".

It's an attempt to force the concept of potential infinity (an endless /process/) into the object-centric paradigm, aligning it with the dominant thought and human bias to portray things as "concluded", "finished", "discrete" or "precise", out of mere common sense.

Is 'completed infinity' bad?

#+begin_index
- *Yes:* it is very bad if this abstraction is applied arbitrarily, without awareness of the constraints of the system that implies or defines it; even worse would be then mistaking this particular system as fundamentally underpinning all reality. What one Matrioshka doll considers true, is not necessarily true for all Matrioshka dolls.

- *No:* completed infinity is not bad, if one wants to play with a system in which this is not considered a contradiction -- go for it, it's entirely legit. But just keep it to that Matrioshka.
#+end_index

I would like to encourage to embrace the infinite and the incomplete as the drivers of "reality, the universe and everything": That there can be -- and that there are -- processes that cannot be completed by any means (and even better: cannot be proved if they complete or not) may be the most probable reason for anything to happen and therefore to exist at all.

*** The Problem of Universals

The traditional metaphysical "[[https://en.wikipedia.org/wiki/Problem_of_universals][Problem of universals]]" concerns the nature of properties, classes, or relations that different "particular" things can all share in common: /Are these universals real entities that exist independently of particular instances, or are they simply names we give to common features we observe?/

Within this framework, universals would be expected to emerge convergently from the interactions and recurrent behaviors by interacting Processes. "Universals" are not static entities that exist in an abstract scale apart from "concrete instances", nor are they mere linguistic constructs.

Within this framework, the "Problem of universals" transcends its historical status as an ontological dilemma, because the appearance of "universals" could be an indicator of shared reality amongst Processes; although there's no clear method for identification and measurement as of now -- likely something along the lines of repeated appearance of universal patterns that carry specific semantic payloads in losely related contexts, recognized by certain Processes.

*** Conceptual Pluralism

Let's acknowledge that there can be several different, but nevertheless entirely valid descriptions to construct anything. Does the "essence", "abstract idea" or whatever spirit dwell in the commonality distilled from all possible, valid descriptions?

"Intrinsic properties" to the rescue"? What about hierarchies of properties and declaring some as more special and more important than others? Well, all of that turns out to circle back so that we arrive at the beginning, looking at one descriptions, which happens to be just one amongst all the others.

Can we unify multiple descriptions into one ultimate description? How?

We can try to find a "translation" from one description to another description. The point is -- there wouldn't be just one single ultimate translation between all the descriptions (what would count as "essence"), but there would be many, and there could be more than one translation between two single descriptions, and maybe there are descriptions we can't find any translation for.

But couldn't we merge these translations into one? What if we put the descriptions aside, and instead pick only the /tranlations/ between them, and then figure out translations between the original translations? Oh, and what if we play this game over and over again -- will we eventually arrive at the ultimate essence of 'triangle'?

What we would likely end up with, may be extremely generalized principles that describe not just 'triangle', but dissolve into a network of relations and transformations that apply across many mathematical structures, quite the contrary of distilling an 'essence' of 'triangleness' -- but maybe that's exactly the point: It not just offers an escape from the "essences" drag, but reminds that meaning arises not from isolated "things in themselves" or "inherent properties", but from relational context.

* Meta

** Design Guidelines

#+begin_index
- Worry later about practicability! (no premature optimization): I do not think much about practicability right now, as I want to explore and develop the ideas first. That's why I start with a "metaphysical framework", which is essentially a speculative construct, that I try to make clearer and coherent and consitant with each iteration. Later I can consider the implementation specifics and how to tackle any challenges that might come with them.

- One of the goals for this ontology is to spot assumptions largely rooted in anthropocentrism as thoroughly as possible and resolve those. It will not be perfect of course but an ongoing process, and I think this is neccessary good practise.

- Prefer the bottom-up approach: when designing the Protoverse ontology, my fundamental premise is that all phenomena are emergent by nature. Only when this assumption ceases to provide meaningful insights, I do consider classifying the phenomenon in question as fundamental.

- Process philosophy's view of reality: Reality is not made up of static substances but rather of ongoing activities. Where I encounter a complex functionality, instead of trying to pin down a rigid structure for it, I could choose to view it as a dynamic process and look where that leads to.
#+end_index

* Scratchpad

