blog/metaphysics.protoverse.project.html
<div id="outline-container-org0be0ce0" class="outline-4">
<h4 id="org0be0ce0"><a href="#org0be0ce0">The Infinite</a></h4>
<div class="outline-text-4" id="text-org0be0ce0">
<p>
The widely accepted invention of &rsquo;completed infinity&rsquo; (masked by the euphemism &rsquo;actual infinity&rsquo;) literally means &ldquo;the finished unfinished&rdquo; and is a contradiction in itself, quite analogous to the &ldquo;square circle&rdquo;.<br>
</p>

<p>
It&rsquo;s an attempt to force the concept of potential infinity (an endless <i>process</i>) into the object-centric paradigm, aligning it with the dominant thought and human bias to portray things as &ldquo;concluded&rdquo;, &ldquo;finished&rdquo;, &ldquo;discrete&rdquo; or &ldquo;precise&rdquo;, out of mere common sense.<br>
</p>

<p>
Is &rsquo;completed infinity&rsquo; bad?<br>
</p>

<div class="index" id="org540ee1e">
<ul class="org-ul">
<li><b>Yes:</b> it is very bad if this abstraction is applied arbitrarily, without awareness of the constraints of the system that implies or defines it; even worse would be then mistaking this particular system as fundamentally underpinning all reality. What one Matrioshka doll considers true, is not necessarily true for all Matrioshka dolls.<br></li>

<li><b>No:</b> completed infinity is not bad, if one wants to play with a system in which this is not considered a contradiction &#x2013; go for it, it&rsquo;s entirely legit. But just keep it to that Matrioshka.<br></li>
</ul>

</div>

<p>
I would like to encourage to embrace the infinite and the incomplete as the drivers of &ldquo;reality, the universe and everything&rdquo;: That there can be &#x2013; and that there are &#x2013; processes that cannot be completed by any means (and even better: cannot be proved if they complete or not) may be the most probable reason for anything to happen and therefore to exist at all.<br>
</p>
</div>
</div>
<div id="outline-container-orgda8d7a2" class="outline-4">
<h4 id="orgda8d7a2"><a href="#orgda8d7a2">The Problem of Universals</a></h4>
<div class="outline-text-4" id="text-orgda8d7a2">
<p>
The traditional metaphysical &ldquo;<a href="https://en.wikipedia.org/wiki/Problem_of_universals">Problem of universals</a>&rdquo; concerns the nature of properties, classes, or relations that different &ldquo;particular&rdquo; things can all share in common: <i>Are these universals real entities that exist independently of particular instances, or are they simply names we give to common features we observe?</i><br>
</p>

<p>
Within this framework, universals would be expected to emerge convergently from the interactions and recurrent behaviors by interacting Processes. &ldquo;Universals&rdquo; are not static entities that exist in an abstract scale apart from &ldquo;concrete instances&rdquo;, nor are they mere linguistic constructs.<br>
</p>

<p>
Within this framework, the &ldquo;Problem of universals&rdquo; transcends its historical status as an ontological dilemma, because the appearance of &ldquo;universals&rdquo; could be an indicator of shared reality amongst Processes; although there&rsquo;s no clear method for identification and measurement as of now &#x2013; likely something along the lines of repeated appearance of universal patterns that carry specific semantic payloads in losely related contexts, recognized by certain Processes.<br>
</p>
</div>
</div>
<div id="outline-container-orgaf9872a" class="outline-4">
<h4 id="orgaf9872a"><a href="#orgaf9872a">Conceptual Pluralism</a></h4>
<div class="outline-text-4" id="text-orgaf9872a">
<p>
Let&rsquo;s acknowledge that there can be several different, but nevertheless entirely valid descriptions to construct anything. Does the &ldquo;essence&rdquo;, &ldquo;abstract idea&rdquo; or whatever spirit dwell in the commonality distilled from all possible, valid descriptions?<br>
</p>

<p>
&ldquo;Intrinsic properties&rdquo; to the rescue"? What about hierarchies of properties and declaring some as more special and more important than others? Well, all of that turns out to circle back so that we arrive at the beginning, looking at one descriptions, which happens to be just one amongst all the others.<br>
</p>

<p>
Can we unify multiple descriptions into one ultimate description? How?<br>
</p>

<p>
We can try to find a &ldquo;translation&rdquo; from one description to another description. The point is &#x2013; there wouldn&rsquo;t be just one single ultimate translation between all the descriptions (what would count as &ldquo;essence&rdquo;), but there would be many, and there could be more than one translation between two single descriptions, and maybe there are descriptions we can&rsquo;t find any translation for.<br>
</p>

<p>
But couldn&rsquo;t we merge these translations into one? What if we put the descriptions aside, and instead pick only the <i>tranlations</i> between them, and then figure out translations between the original translations? Oh, and what if we play this game over and over again &#x2013; will we eventually arrive at the ultimate essence of &rsquo;triangle&rsquo;?<br>
</p>

<p>
What we would likely end up with, may be extremely generalized principles that describe not just &rsquo;triangle&rsquo;, but dissolve into a network of relations and transformations that apply across many mathematical structures, quite the contrary of distilling an &rsquo;essence&rsquo; of &rsquo;triangleness&rsquo; &#x2013; but maybe that&rsquo;s exactly the point: It not just offers an escape from the &ldquo;essences&rdquo; drag, but reminds that meaning arises not from isolated &ldquo;things in themselves&rdquo; or &ldquo;inherent properties&rdquo;, but from relational context.<br>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgde550d2" class="outline-2">
<h2 id="orgde550d2"><a href="#orgde550d2">Meta</a></h2>
<div class="outline-text-2" id="text-orgde550d2">
</div>
<div id="outline-container-orgbca8335" class="outline-3">
<h3 id="orgbca8335"><a href="#orgbca8335">Design Guidelines</a></h3>
<div class="outline-text-3" id="text-orgbca8335">
<div class="index" id="org2afbea4">
<ul class="org-ul">
<li>Worry later about practicability! (no premature optimization): I do not think much about practicability right now, as I want to explore and develop the ideas first. That&rsquo;s why I start with a &ldquo;metaphysical framework&rdquo;, which is essentially a speculative construct, that I try to make clearer and coherent and consitant with each iteration. Later I can consider the implementation specifics and how to tackle any challenges that might come with them.<br></li>

<li>One of the goals for this ontology is to spot assumptions largely rooted in anthropocentrism as thoroughly as possible and resolve those. It will not be perfect of course but an ongoing process, and I think this is neccessary good practise.<br></li>

<li>Prefer the bottom-up approach: when designing the Protoverse ontology, my fundamental premise is that all phenomena are emergent by nature. Only when this assumption ceases to provide meaningful insights, I do consider classifying the phenomenon in question as fundamental.<br></li>

<li>Process philosophy&rsquo;s view of reality: Reality is not made up of static substances but rather of ongoing activities. Where I encounter a complex functionality, instead of trying to pin down a rigid structure for it, I could choose to view it as a dynamic process and look where that leads to.<br></li>
</ul>

</div>
</div>
</div>
</div>
