blog/metaphysics.protoverse.project.org
** Is There an Ultimate Reality?

Taken the term in its original meaning, immediately breaks out from the Protoverse, through all scales in all directions of our known world, and seeks to get hold of the most profound. I don't regard the question as useless, but rather as a tool for personal reflection. It sheds some light on values, biases, where the focus is, and the voids -- uncharted territories for planning the next vacation. It seems a good idea to answer this question from time to time. Let's try:

I'm largely agnostic about the question if there could be an ultimate reality and respectively its knowability ("Theory Of Everything"). At the moment, I lean to a view that what we commonly expect to count as "ultimate reality" is multi-faceted -- much like in a sense that we could hypothetically develop several equally meaningful perspectives, like say highly developed "theories of everything" -- physical or otherwise. Each of these TOE coherent, valid in terms of "empirically confirmed" to high degrees and so on, as far as the scientific method allows.

What we might find is that, taken these separate hypothetical theories, there can be morphisms between them. These morphisms themselves are what comes closest to "ultimate reality". The "ultimate reality" is not in the instantiation (e.g. not physical), not "existing" (to use common metaphysical terminology), but in the translations between descriptions; and that there can be several ones.

** Relevant beliefs and values:

- Difference is profound
- Recursion is profound
- The beginning/end doctrine is a human invention (anthropomorphism)
- Embrace circular dependence; e.g. "dependent origination"
- Coherence globally, fundamentals locally
- No meaning without references and relations
- Cartesian worldview leads to eye rolling (strong feelings here)
- Darwinian evolutionary processes are universal - same same, but different
- Physical laws and phenomena are not fundamental but emergent or evolved
- There's no "imperfection" in nature, but complexity misunderstood
- Desire for the absolute, closed, discrete, perfect, precise is a cognitive bias
- The unfinished and infinite are not flaws, but potentials for becoming
- Be careful with (ad-hoc) formal systems; they are tools, not truths
- Mathematics: I lean towards constructivism
- Potential infinity is legit; actual infinities are ok within certain formal systems, on equal footing as art
- Equality is a human invention, rooted in bias and over-application of formal systems
- Closed systems cannot exist
- Be sceptic of classical logic; consider application of paraconsistend logic, fuzzy logic
- There might be no distinction between "ontic" and "epistemic"
- Unconditionally fully developed multiverse are nonsensical, however they could make sense in the small (quantum scale uncertainty), but subject to viability pressures, so there might exist a few that could be either similar or very different.

** Delimited Relational State Update

Felt like it meant something, might delete later. It's just a crude, playful train of thought, not sure what to with it, or if it might be relevant:

Theoretically you could ask"" a Process for a Property, at any occasion (provided a interface or device that let's you interact with a specific Process), and it will give you an answer -- it will /realize this Property/ in turn. Note: that Property hasn't there before, it will be generated. So as an example, let's ask a Process for its "identity":

How does the Process understand the request? Based on what language or protocol? And how does a Process "know" or "decide" what to respond to our specific question?

Well, all that complicated stuff like protocols would be entirely superflous, if the Process wouldn't have to "know" or "decide" what to respond. And that can be so, under the circumstance that it /only can do one thing/, and responds with /one thing/ subsequently.

If a Process only can do /one thing/ and responds according to that, then the Process cannot and doesn't need to "understand" the question to begin with. For the Process it makes no difference if you ask it for its "identity" or "position" or "spin", as long your question is well-formed. It will /do its one thing/ and therefore generate its answer.

Each "question" (you may call it "measurement" at this point) is superficially just a trigger for the Process to realize its /relational state/ -- this is the /one thing/ it does and can do.

The missing link: Whatever is connected to this Process during the query (which may include probablistic anticipations and uncertainties), becomes an integral part of the relational state it realizes when triggered -- that relational state /includes you/ (by your interface or measuring device) -- a bit like if the process takes a selfie with you in it. More accurately, it includes the /processes that are you/ and their relational states (there are plenty).

It's up to you to interpret the reply from the Process, which is like an oracle. Like an oracle's gibberish, the Process' reply is entirely meaningless in itself. But as you have setup everything in order to ask the process a specific question (in this example, for a Property), it happened that you framed and narrowed down the answer (to a /certain precision/).

The Process did not "answer" your question of course, since it couldn't even understand it. The reply that came from the Process, is eventually more like a hash value that completed and closed this specific loop.

What does a relational state include, is there a limit or border how far or deep this relational state reaches? What's included and what not? What does the realization of a relational state require -- does it have a "time" duration or other 'cost', depending on what? Does this "border" expand, and does this expansion vary?

Ok, let's assume that the effort to realize ("query") very complex relational states (more nested or far-reaching relations) is higher than the effort to realize relational states of lower complexity (less relations, trivially structured, or not so far-reaching).

'Far-reaching' in this sense could either mean 'in time', 'in space', both, or neither. We must consider that time, space and various physical phenomena may arise from the realization of relational states, rather than assuming these phenomena a priori. So there's a 'cost' involved in realizing relational state.

We may assume that realizing very complex relational state may require a huge effort. This could be expected if two vast conglomerates of processes with are constituted through a vast amount of relations interact.

** Cognitive object-heuristic and Platonic thinking

While these heuristics are beneficial for practical purposes, they may also be limiting. This is reflected in the Platonic Ideals, and their postulate reinforced and encouraged a view of nature that seeks out unchanging laws and fundamental building blocks—the 'objects' of the universe.

