blog/metaphysics.protoverse.project.html
<div id="outline-container-org0f14084" class="outline-2">
<h2 id="org0f14084"><a href="#org0f14084">Scratchpad</a></h2>
<div class="outline-text-2" id="text-org0f14084">
</div>
<div id="outline-container-orgbb66c1a" class="outline-3">
<h3 id="orgbb66c1a"><a href="#orgbb66c1a">Is There an Ultimate Reality?</a></h3>
<div class="outline-text-3" id="text-orgbb66c1a">
<p>
Taken the term in its original meaning, immediately breaks out from the Protoverse, through all scales in all directions of our known world, and seeks to get hold of the most profound. I don&rsquo;t regard the question as useless, but rather as a tool for personal reflection. It sheds some light on values, biases, where the focus is, and the voids &#x2013; uncharted territories for planning the next vacation. It seems a good idea to answer this question from time to time. Let&rsquo;s try:<br>
</p>

<p>
I&rsquo;m largely agnostic about the question if there could be an ultimate reality and respectively its knowability (&ldquo;Theory Of Everything&rdquo;). At the moment, I lean to a view that what we commonly expect to count as &ldquo;ultimate reality&rdquo; is multi-faceted &#x2013; much like in a sense that we could hypothetically develop several equally meaningful perspectives, like say highly developed &ldquo;theories of everything&rdquo; &#x2013; physical or otherwise. Each of these TOE coherent, valid in terms of &ldquo;empirically confirmed&rdquo; to high degrees and so on, as far as the scientific method allows.<br>
</p>

<p>
What we might find is that, taken these separate hypothetical theories, there can be morphisms between them. These morphisms themselves are what comes closest to &ldquo;ultimate reality&rdquo;. The &ldquo;ultimate reality&rdquo; is not in the instantiation (e.g. not physical), not &ldquo;existing&rdquo; (to use common metaphysical terminology), but in the translations between descriptions; and that there can be several ones.<br>
</p>
</div>
</div>
<div id="outline-container-orga9106d4" class="outline-3">
<h3 id="orga9106d4"><a href="#orga9106d4">Relevant beliefs and values:</a></h3>
<div class="outline-text-3" id="text-orga9106d4">
<ul class="org-ul">
<li>Difference is profound<br></li>
<li>Recursion is profound<br></li>
<li>The beginning/end doctrine is a human invention (anthropomorphism)<br></li>
<li>Embrace circular dependence; e.g. &ldquo;dependent origination&rdquo;<br></li>
<li>Coherence globally, fundamentals locally<br></li>
<li>No meaning without references and relations<br></li>
<li>Cartesian worldview leads to eye rolling (strong feelings here)<br></li>
<li>Darwinian evolutionary processes are universal - same same, but different<br></li>
<li>Physical laws and phenomena are not fundamental but emergent or evolved<br></li>
<li>There&rsquo;s no &ldquo;imperfection&rdquo; in nature, but complexity misunderstood<br></li>
<li>Desire for the absolute, closed, discrete, perfect, precise is a cognitive bias<br></li>
<li>The unfinished and infinite are not flaws, but potentials for becoming<br></li>
<li>Be careful with (ad-hoc) formal systems; they are tools, not truths<br></li>
<li>Mathematics: I lean towards constructivism<br></li>
<li>Potential infinity is legit; actual infinities are ok within certain formal systems, on equal footing as art<br></li>
<li>Equality is a human invention, rooted in bias and over-application of formal systems<br></li>
<li>Closed systems cannot exist<br></li>
<li>Be sceptic of classical logic; consider application of paraconsistend logic, fuzzy logic<br></li>
<li>There might be no distinction between &ldquo;ontic&rdquo; and &ldquo;epistemic&rdquo;<br></li>
<li>Unconditionally fully developed multiverse are nonsensical, however they could make sense in the small (quantum scale uncertainty), but subject to viability pressures, so there might exist a few that could be either similar or very different.<br></li>
</ul>
</div>
</div>
<div id="outline-container-org016139f" class="outline-3">
<h3 id="org016139f"><a href="#org016139f">Delimited Relational State Update</a></h3>
<div class="outline-text-3" id="text-org016139f">
<p>
Felt like it meant something, might delete later. It&rsquo;s just a crude, playful train of thought, not sure what to with it, or if it might be relevant:<br>
</p>

<p>
Theoretically you could ask&ldquo;&rdquo; a Process for a Property, at any occasion (provided a interface or device that let&rsquo;s you interact with a specific Process), and it will give you an answer &#x2013; it will <i>realize this Property</i> in turn. Note: that Property hasn&rsquo;t there before, it will be generated. So as an example, let&rsquo;s ask a Process for its &ldquo;identity&rdquo;:<br>
</p>

<p>
How does the Process understand the request? Based on what language or protocol? And how does a Process &ldquo;know&rdquo; or &ldquo;decide&rdquo; what to respond to our specific question?<br>
</p>

<p>
Well, all that complicated stuff like protocols would be entirely superflous, if the Process wouldn&rsquo;t have to &ldquo;know&rdquo; or &ldquo;decide&rdquo; what to respond. And that can be so, under the circumstance that it <i>only can do one thing</i>, and responds with <i>one thing</i> subsequently.<br>
</p>

<p>
If a Process only can do <i>one thing</i> and responds according to that, then the Process cannot and doesn&rsquo;t need to &ldquo;understand&rdquo; the question to begin with. For the Process it makes no difference if you ask it for its &ldquo;identity&rdquo; or &ldquo;position&rdquo; or &ldquo;spin&rdquo;, as long your question is well-formed. It will <i>do its one thing</i> and therefore generate its answer.<br>
</p>

<p>
Each &ldquo;question&rdquo; (you may call it &ldquo;measurement&rdquo; at this point) is superficially just a trigger for the Process to realize its <i>relational state</i> &#x2013; this is the <i>one thing</i> it does and can do.<br>
</p>

<p>
The missing link: Whatever is connected to this Process during the query (which may include probablistic anticipations and uncertainties), becomes an integral part of the relational state it realizes when triggered &#x2013; that relational state <i>includes you</i> (by your interface or measuring device) &#x2013; a bit like if the process takes a selfie with you in it. More accurately, it includes the <i>processes that are you</i> and their relational states (there are plenty).<br>
</p>

<p>
It&rsquo;s up to you to interpret the reply from the Process, which is like an oracle. Like an oracle&rsquo;s gibberish, the Process&rsquo; reply is entirely meaningless in itself. But as you have setup everything in order to ask the process a specific question (in this example, for a Property), it happened that you framed and narrowed down the answer (to a <i>certain precision</i>).<br>
</p>

<p>
The Process did not &ldquo;answer&rdquo; your question of course, since it couldn&rsquo;t even understand it. The reply that came from the Process, is eventually more like a hash value that completed and closed this specific loop.<br>
</p>

<p>
What does a relational state include, is there a limit or border how far or deep this relational state reaches? What&rsquo;s included and what not? What does the realization of a relational state require &#x2013; does it have a &ldquo;time&rdquo; duration or other &rsquo;cost&rsquo;, depending on what? Does this &ldquo;border&rdquo; expand, and does this expansion vary?<br>
</p>

<p>
Ok, let&rsquo;s assume that the effort to realize (&ldquo;query&rdquo;) very complex relational states (more nested or far-reaching relations) is higher than the effort to realize relational states of lower complexity (less relations, trivially structured, or not so far-reaching).<br>
</p>

<p>
&rsquo;Far-reaching&rsquo; in this sense could either mean &rsquo;in time&rsquo;, &rsquo;in space&rsquo;, both, or neither. We must consider that time, space and various physical phenomena may arise from the realization of relational states, rather than assuming these phenomena a priori. So there&rsquo;s a &rsquo;cost&rsquo; involved in realizing relational state.<br>
</p>

<p>
We may assume that realizing very complex relational state may require a huge effort. This could be expected if two vast conglomerates of processes with are constituted through a vast amount of relations interact.<br>
</p>
</div>
</div>
<div id="outline-container-org9ddad7b" class="outline-3">
<h3 id="org9ddad7b"><a href="#org9ddad7b">Cognitive object-heuristic and Platonic thinking</a></h3>
<div class="outline-text-3" id="text-org9ddad7b">
<p>
While these heuristics are beneficial for practical purposes, they may also be limiting. This is reflected in the Platonic Ideals, and their postulate reinforced and encouraged a view of nature that seeks out unchanging laws and fundamental building blocks—the &rsquo;objects&rsquo; of the universe.<br>
</p>
</div>
</div>
