blog/metaphysics.protoverse.project.org
** Approximation and Uncertainty in Nature

Our misunderstandings about uncertainty and approximation could be due to the habit of objectifying nature -- the permanent strive for completeness, closedness and discreteness. This objectification is obviously practical, but might lead to the erroneous assumption that approximations are merely tools for dealing with our imperfect knowledge, instead of potentially fundamental aspects of reality itself.
