blog/metaphysics.protoverse.project.html
<div id="outline-container-org2c075bf" class="outline-3">
<h3 id="org2c075bf"><a href="#org2c075bf">Approximation and Uncertainty in Nature</a></h3>
<div class="outline-text-3" id="text-org2c075bf">
<p>
Our misunderstandings about uncertainty and approximation could be due to the habit of objectifying nature &#x2013; the permanent strive for completeness, closedness and discreteness. This objectification is obviously practical, but might lead to the erroneous assumption that approximations are merely tools for dealing with our imperfect knowledge, instead of potentially fundamental aspects of reality itself.<br>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
